{"target":"       BuzzFeed  Inc                         The bill would reshape the tax code in favor of corporations and do more to undercut Obamacare than anything Republicans have yet managed to pass.          Senate Republicans passed their version of a massive tax overhaul just before   a.m. Saturday morning  knocking off one more obstacle to President Donald Trump and the Republican Congress s first major legislative achievement this year. The bill   the final text of which was released publicly after      p.m. Friday  and still contained scribbles in the margins   would vastly rewrite how the US tax code works  favoring corporations large and small  owned by a few partners or by a globally diversified shareholder base. The bill would also be Trump and the Republican Congress s biggest step in unwinding the Affordable Care Act  as it would eliminate the individual mandate to buy health insurance. The Congressional Budget Office estimates that the change would jack up premiums and lead to    million more uninsured people than there would otherwise be in    years  and   million more in     . The Senate passed the bill        with Sen. Bob Corker the only Republican voting against the bill. Vice President Mike Pence was on hand to preside over the vote  and was met with applause after reading out the final tally. Frustrated Democrats  meanwhile  had abandoned the floor after voting. Speaking to reporters as he left the White House for New York City on Saturday morning  President Trump praised the senators for passing  tremendous tax reform.   People are going to be very  very happy. They re going to get tremendous  tremendous tax cuts and tax relief  and that s what this country needs   he said. Trump this morning on tax bill   It was the biggest package in terms of tax cuts ever passed in our country...peopl  https   t.co zFSba z Lz The next step for the legislation is up to the House of Representatives. The House can either pass the Senate s bill as is  or go to conference with the Senate to meld the bill with the legislation House Republicans recently  passed . The House bill has a different structure for individual tax rates and a different approach to taxing businesses run by their owners than the Senate bill  and it includes a complete elimination of the estate tax. The House bill also scraps the deduction people can claim for medical expenses and puts the     corporate rate into effect faster. House leadership is  currently planning  on moving to a conference to combine the bills as quickly as possible. In a  statement  Saturday morning  House Speaker Paul Ryan congratulated Senate Republicans on the bill and said   Now we will move quickly to a conference committee so we can get a final bill to President Trump s desk.  Trump tweeted just before   a.m. on Saturday that he hopes to reach that point before the end of the year. We are one step closer to delivering MASSIVE tax cuts for working families across America. Special thanks to  https   t.co L  UncQMZS For now  the feeling among Senate Republicans is emphatically positive.  This is a great day for America   Senate Majority Leader Mitch McConnell told reporters after the vote Saturday morning.  After an up and down several days  Republican leaders were bullish on the bill for most of the day Friday. Senate leadership appeared to have secured    votes for the bill Friday afternoon  well before the bill was finalized.  I m ecstatic   Sen. David Perdue told BuzzFeed News late Friday night.  The publicly released Senate tax bill they re voting on tonight still has the infamous scribbles Senate Democrats were livid about the bill and the process that played out Friday night  as a flow of late changes were made to the bill just before it came to the floor for a vote.  Historians will mark today as one of the darkest black letter days in the long history of the Senate   Senate Minority Leader Chuck Schumer said from the floor  soon before the vote. The bill  he said   was chock full of special interest giveaways before tonight  but under the cover of darkness and with the aid of haste  a flurry of last minute changes will stuff even more money into the pockets of the wealthy and the biggest corporations  while raising taxes on millions in the middle class.   McConnell hit back at Schumer in his own comments after the vote.  You complain about process when you re losing   he said. Senate Democrats seized upon one obscure amendment late Friday night that they claimed would exempt a single Michigan liberal arts school  Hillsdale College  from a new tax on endowment income. The college is a conservative beacon in the culturally liberal higher education world. It rejects most federal funding  including student loans  and many of its students go on to work in conservative movement institutions. Erik Prince  the brother of Education Secretary Betsy DeVos and founder of the controversial security firm Blackwater  is one prominent alumnus. Sen. Pat Toomey  who included the amendment  defended the college on the Senate floor.  I actually think it s a wonderful institution... I commend them for their choice  as other colleges  of foregoing taxpayer money that they could be taking... I think any college in that category  whether it s Hillsdale or any other college  ought not to have to pay the tax on endowment.   Schumer described the amendment as a  metaphor for the whole bill.  The fate of the amendment  though  proved a lonely bright spot for Democrats  It was defeated just after   a.m.  soon before the final vote  with four Republicans joining all Democrats in voting against it.  I was just handed a     page tax bill a few hours before the vote. One page literally has hand scribbled policy cha  https   t.co JdMIEfWZgj In order to pay for at least some of the large cuts in the Senate plan   businesses run by their owners would be able to deduct     of their income before paying taxes  while the rate paid by corporations on their income would fall to       a wide swathe of deductions enjoyed by higher income wage earners would fall away  notably the deduction for state and local taxes.  The amount that these businesses   which include everything from dry cleaners to real estate partnerships   would be able to deduct from their tax bills was a key point of contention among Republicans going into Friday. Sens. Steve Daines and Ron Johnson only came on board with the bill Friday morning  after the deduction moved up from   .   to     over the past week. In order to pay for broader and deeper cuts  the Senate also scrapped their total repeal of the alternative minimum tax for individuals   a separate tax system that s supposed to ensure that people don t use deductions to excessively wipe out their tax liability. Getting rid of the AMT was supposed to be one of the ways the House and Senate tax bills would simplify the code. Instead  the Senate put the tax system back into the bill with modifications on Friday. The House bill eliminates the tax.  Throughout Friday  senators who had held out because of their concern about tax cuts not being extensive enough won key concessions  while those that were on the fence because they thought the bill would expand deficits too much walked away with less solid commitments. Sen. Susan Collins  the Maine Republican who voted against the Senate s health care bill and was viewed as a key vote for the tax plan  got several amendments into the bill  including letting taxpayers deduct the first         of their property tax bills from their federal taxes.  I think we should be cutting everyone s taxes   Sen. Ted Cruz said.  Susan Collins prevailed in amending the bill to exclude         of property taxes from your federal income tax liability   that s a significant improvement.  As the bill was being rewritten Thursday night and through Friday  Republicans were able to scrounge up money to allow them to further cut taxes without increasing the cost of the bill  but rejected entirely proposals to reduce the fiscal impact as a whole. After the bill hit a snag Thursday night  Republicans were discussing adding automatic increases in the corporate tax from its proposed     rate in order to eliminate at least      billion in added debt over the next    years. This was at the urging of Sen. Bob Corker  who had earlier proposed an automatic tax hike if the bill didn t raise enough money from added economic growth. That so called  trigger  option was rejected by the Senate parliamentarian due to rules that allowed the Senate to pass the bill with only a bare majority of votes  leaving the Senate to look elsewhere for ways to assuage Corker as well as Sen. Jeff Flake. By Friday morning  however  the tax hikes were dead.  It was extended conversation that went on into the late hours of the night and continued early in the morning   Cruz said Friday  explaining how the Senate came to reject the hikes entirely.  I and a number of other senators had strong objections to that proposal  and that proposal did not carry the day. The      billion in tax increases is not in the bill   that was the right thing to do.  Corker was unable to bring any Republicans with him to vote against the bill   Sens. James Lankford and Jeff Flake  who had originally supported a  trigger  mechanism and did not declare their position on the bill until late this week  did not join Corker.  I ve never tried to rally  them    each person has to vote their conscience and that s what this is all about   Corker said.  I am disappointed. I wanted to get to yes. But at the end of the day  I am not able to cast aside my fiscal concerns and vote for legislation that I believe  based on the information I currently have  could deepen the debt burden on future generations   Corker said in a statement.  I m a dinosaur on the fiscal issues   he said earlier Friday. Other Republicans mainly had praise for Corker  despite his dissenting vote.  I respect Bob so much as senator   Perdue told BuzzFeed News late Friday night. Trump and Corker  had a really great conversation   he added.  Bob called the president  there was a clearing of the minds. It was very professional. I m sure the President tried to beseech him. I m very impressed with Bob and how he handled this.  Sen. Corker on Nov.   . The bill includes  at least temporarily  some direct benefits for normal taxpayers  The standard deduction that people are allowed to lop off their taxable income if they don t claim other deductions would increase from        to         for individuals  and from         to         for married couples  while the child tax credit would be expanded up to        from       . For wealthy taxpayers  there are direct benefits as well  The first     million of estates transferred upon death would go untaxed  while the top overall tax rate would fall to   .   from   .  . But the Senate s tax bill is hardly static. It will force future Congresses and presidents to make choices about whether to continue its benefits for middle income taxpayers or possibly expand the deficit even further than currently projected. The Joint Committee on Taxation  Congress s tax scorekeepers  projected Thursday that  even accounting for the effects on economic growth  the bill would add    trillion to the deficit over    years. But that s assuming that most of the personal tax changes expire at the end of       as they re scheduled to under the bill. The final projection could also still change somewhat  as the JCT s Thursday estimate was based on earlier text of the bill. The bill includes a change in the way tax brackets grow  meaning that over time  as individuals  incomes went up  they would enter a new bracket and pay a higher marginal rate. By       about half of all taxpayers would be paying more in taxes than they would otherwise  according to the Tax Policy Center  while higher income taxpayers would be paying less. If nothing is allowed to expire  the Committee for a Responsible Federal Budget estimates that the real cost of the tax bill in    years would be over    trillion in new debt. These estimates have been hotly contested by most Republican senators  who insist that the bill would generate such high economic growth that it would wash out most negative effects on the debt  and would supercharge wages paid to most American workers.  I m totally confident this is a revenue neutral bill   actually a revenue producer   McConnell said after the final vote.   The best way to pay down the deficit is economic growth and cutting taxes   Cruz said earlier Friday.  In order to get the bill passed  Trump has also committed to supporting two pieces of legislation before the end of the year that would help partially alleviate the spike in insurance premiums that would come from fewer people buying into Obamacare s individual market. But what will emerge from the conference process and whether it will gain the assent of both the House and Senate remains to be seen.  One step at a time   I don t want to get ahead of myself   Sen. Lisa Murkowski  a key yes vote for the bill  said.  We will deal with what happens in conference when we have the opportunity to do that.   Twelve Republican members of the House of Representatives  sent a letter to McConnell  opposing a provision in the Senate tax bill that would open up the Arctic National Wildlife Refuge in Alaska to energy exploration  which was not included in the House bill but is a major priority for Murkowski.  I plan to do everything that I can to make sure that the promise to Alaska is fulfilled and they open up ANWR   Murkowski said. Murkowski was celebratory after the bill passed with the ANWR measure included.  We have been trying to open to oil and gas production for    years now   she told reporters.  I m sure they re back channelling discussions   Senate Majority Whip John Cornyn said earlier Friday about any negotiations between the House and Senate.  I ve always expected there d be a conference with the House   there s a number of things we ve done that they didn t do that has to be reconciled one way or the other.         Matthew Zeitlin is a business reporter for BuzzFeed News and is based in New York. Zeitlin reports on Wall Street and big banks.             Contact Matthew Zeitlin at  matt.zeitlin buzzfeed.com .            Got a confidential tip   Submit it here .       Great                      You re almost there  Check your inbox and confirm your subscription now                  Great                      You re almost there  Check your inbox and confirm your subscription now                   BuzzFeed Home  Sitemap        BuzzFeed  Inc.","cluster":["This material may not be published  broadcast  rewritten  or redistributed.       FOX News Network  LLC. All rights reserved. All market data delayed    minutes. Senate majority leader provides insight about the tax bill and the controversial Alabama Senate race on  The Ingraham Angle.   This is a rush transcript from  The Ingraham Angle   November         . This copy may not be in its final form and may be updated.  LAURA INGRAHAM  HOST  Good evening  everyone  from Washington. This is  The Ingraham Angle.  What a day  too much news for just one hour  but we will get through it together. We have gathered the very best for you tonight. A huge breakthrough in the president s tax plan in the Senate. I talk to Senate Majority Leader Mitch McConnell about what kind of break you might get  at least you hope you are going to get. We get his take on that wild Senate race in Alabama and what might happen to Roy Moore if he actually gets elect. I also sit down with Marco Rubio on the possible existence  get this  of a sexual harassment slush fund in the Senate. Stay tuned for that. And Herman Cain is here as well. We haven t seen him in a while. We re going to ask him if the sexual assault allegations are going too far. I will also deliver a very important message to all of your Melania haters out there in the media. That will be at the end of the hour. You do not want to miss it. But  first  we start with a question that s on the minds of many Americans.  VIDEO CLIP  INGRAHAM  I guess where he was all those trips. Well  we know tonight that we can report  of course  Matt Lauer is no longer the anchor over at the  Today  show. fired overnight and reportedly with no warning. Lauer is the second morning anchor to fall in just a week. They had one of the biggest runs on television ever most profitable franchise in television history. NBC said the firing followed recent accusations from one coworker. Variety magazine did their own two month investigation published today and found evidence of a lot more wider and abusive conduct. Hours after that the  New York Times  reported two more claims. And Lauer s co worker  Savannah Guthrie  Hoda Kotb  learned of the news  of his firing  just before they reported it at the top of the  Today Show.  That s quite an opening. They all and their colleagues at    Rock were visibly shaken by this news.  BEGIN VIDEO CLIP  SAVANNAH GUTHRIE  HOST   TODAY   All we can say is that we are heartbroken. I m heartbroken for Matt. He is my dear  dear friend and my partner  and he is beloved by many  many people here. And I m heartbroken for the brave colleague that came forward to tell her story and any other women who have their own stories to tell. How do you reconcile your love for someone with the revelation that they have behaved badly  HODA KOTB  GUEST HOST   TODAY   I have known matt for    years. It s hard to reconcile what we are hearing with the man who we know who walks in this building every single day. KATHIE LEE GIFFORD  CO HOST   TODAY WITH KATHIE LEE AND HODA   I texted him this morning and said  Matt  I adore you  and no person is perfect in this world. Nobody is. WILLIE GEIST  CO HOST   TODAY   My thoughts  of course  with Matt. He has been a friend. He has been a mentor. He has been a guy you could watch  a guy who led by his example on the set. UNIDENTIFIED MALE   MORNING JOE   I am stunned by this. I have known Matt for    years. I consider him to be a friend. Willie was apt in his description of Matt.  END VIDEO CLIP  INGRAHAM  Then again maybe there were some warning signs just below the radar. Back in       Lauer s long time co host  Katie Couric  said something in an interview that didn t get much notice at the time but maybe it should have.  BEGIN VIDEO CLIP   WATCH WHAT HAPPENS LIVE  BRAVO  JUNE           ANDY COHEN  HOST  You hosted the  Today  show with Matt Lauer for    years. What is Matt s most annoying habit  KATIE COURIC  FORMER  TODAY  SHOW CO HOST  He pinches me on the ass a lot.  END VIDEO CLIP  INGRAHAM  Lovely. Said it with kind of a sour face there. Katie wasn t kidding. That s kind of genuine disgust. It makes you wonder how NBC supposedly missed this for all these years. Also getting a close second look is a  Today  show promo that seemed to openly hint at Lauer s reputation for inappropriate behavior with ladies. And possibly a habit of  I don t know  walking around without his pants   BEGIN VIDEO CLIP   TODAY  NBC  DEC.           MATT LAUER  CO HOST  Ah  drink it  in ladies.  NATALIE MORALES  CO HOST  Again  Matt  really  JENNA BUSH HAGER  CO HOST  It s the third time this week. TAMRON HALL  CO HOST  Did your mommy give you those  MORALES  HAGER  amp  HALL  WAAAAH  SAVANNAH GUTHRIE  CO HOST  Stop it you are making me lactate. LAUER  Get it while it lasts.  END VIDEO CLIP  INGRAHAM  Again  NBC claims none of their current leadership knew about Lauer s past  but it seems kind of hard to believe now. To help us make sense of all of this the shock waves in the media world will bring in Fox News media analyst  Howie Kurtz. One thing that was interesting today  Joe Flint tweeted the following. He said   NBC News doubles down. We can now equivocally say prior to Monday night  current NBC News management was never made any aware of any complaints about Matt Lauer s conduct   network said.  Current NBC management. Jeff Zucker over at CNN was the executive producer of the  Today  show for many years. Very successful  and he had a very terse statement through a spokesperson that there was never a complaint filed against him during his time there. HOWARD KURTZ  FOX NEWS MEDIA ANALYST  Well  the complaint part might be true  but it certainly raises a lot of questions about who at NBC management  inaudible  times knew about this. NBC  Laura  tried to seize the moral high ground by saying we fired Matt Lauer as soon as we got this complaint    hours. It s true that NBC took swift action. But  clearly  this was a preemptive move before the Variety piece comes out with allegations about him giving a sex toy to a coworker  exposing himself     INGRAHAM  There is a photo apparently that they have now. KURTZ  I mean  this is pretty graphic stuff. And a New York Times piece talks about a woman who said she did have sex in      with Matt Lauer that she felt pressured to save her job. So  NBC tried to control the narrative by not putting out much detail  getting out ahead of these reports that shows that these allegations have been out there for some time. INGRAHAM  Just going back to Jeff Zucker  though  it reminds me of what we were hearing about Harvey Weinstein that oh  I m shocked. I can t believe that Harvey Weinstein  and then you heard    I had heard about Harvey Weinstein back in     . I was on the  Today Show  a bunch of times. I always liked Matt Lauer. He was you a liberal guy. He was nothing but nice to me. I had very minimal reaction with him. From the Katie Couric comment to that odd promo. There were a couple other things that have popped up on tape. It s a little strange for a network that prides itself on being so pro  women and we are all for girl power and it s a little odd and Jeff Zucker  he doesn t come out on camera today  one of his old friends  old buddies. Nothing. KURTZ  You have to cringe looking at these now skits and what Katie Couric said and all of that  but you know  what happened is the environment has changed. Whereas it might have been easy for NBC and other networks  Laura  other networks have had this these problems. INGRAHAM  We have. KURTZ  But to look the other way  to not take it seriously  turn a blind eye to some of the women who were complaining in the era of Harvey Weinstein and all the politicians now Al Franken and Roy Moore  John Conyers    CBS dumps Charlie Rose right away  and NBC dumps Matt Lauer right away  but there are a lot of unanswered questions here about what  who knew what  and was NBC allowing     INGRAHAM  They are not revealing the name of the young woman who said in      he approached her at the Olympics. KURTZ  Right. Now  I think that may be because that woman and perhaps other women are not ready to go forward  and you can understand them not wanting their lives to blown up. At the same time  it just fuels    this is the beginning of the story a lot more to know about this and the way the networks now respond to these kinds of allegations and who knew what when. INGRAHAM  This is the revenge of Ann Curry  someone     KURTZ  Unceremoniously. INGRAHAM  Other people wanted to talk to. I would like to hear from all of them. I appreciate it  Howie. Thank you so much. Sex assault accusations are serious  but can the current climate go too far and when is just an allegation just enough to try to take a public figure down  My old boss  Supreme Court Justice Clarence Thomas  knows a thing or two about that. And so  does my next guest  former presidential candidate  Herman Cain  speaking publicly for the first time in its current climate about the accusations that derailed his bid for the White House in     . Herman  it s great to see you first of all. Welcome back to the network. This has been a wild time. A lot of icons in the media world. One after the other taken down  a producer from  State of the Union  on CNN  it was unceremoniously fired today for inappropriate conduct. No sexual attack or anything  but inappropriate conduct  and the list goes on and on. What are your feelings about given the accusations against you in       HERMAN CAIN       GOP PRESIDENTIAL CANDIDATE  Well  first  Laura  congratulations on your new show     INGRAHAM  Thank you. CAIN      The Ingraham Angle  and now you are going to get the Cain critique on the subject that you raised. First of all  you can t look at all of these the same because they are not. Some of them have evidence  including pictures that it actually happened. Some of them were based upon accusations  speculation  but no confirmation. Now  I can t talk about all these situations  but I can talk about my situation. There were a lot of accusations and there was a lot of speculation to try to derail my campaign but no confirmation. And the reason was the liberal media didn t want to know the truth. They did not want to know what the facts were about the people that were accusing me. Now what s different about my situation  and let s just say Roy Moore s situation  is that they came after me with repeatedly attacks and accusations but no confirmation. They now believe that if they throw more and more and more mud on the wall  that eventually people are going to believe it  but that has back fired because  as you know  the latest poll shows Roy Moore is now back in the lead in Alabama and the people in Alabama are going to have to decide. INGRAHAM  Herman  you decided to bow out in     . You had a really  you know  strong and vibrant following. CAIN  Yes. INGRAHAM  A lot of people just liked your presence in the race. But when these things started ping  ping  ping  one after another coming out you just decided for my family s sake  I m not going to continue. Do you regret that now looking back  Do you wish you had stayed in and fought it out  CAIN  No  I do not. Because as you pointed out  they came week one  week two  week three  and what we concluded was that it was going to continue four  five  and six  the way it did with the Judge Roy Moore. I bowed out primarily because not because I couldn t take the harassment  I couldn t take the firestorm. But because my family  grandchildren especially  start to hear jokes about their Pappa on the music stations and I did not want that to continue. If I had stayed in the race  it was only going to get worse and worse and worse. Why  Because the liberal media who wanted to develop a firestorm to stop somebody  they were not going to stop  and I didn t want to continue to put my family members at all levels in that position. INGRAHAM  I want to share something with you that happened today  apparently at this Democratic caucus meeting  and this was involving the John Conyers situation. There is a push probably that looks like  you know  boot him out of Congress and encourage him to resign. James Clyburn has compared John Conyers  accusers to the child murderer  Susan Smith  who initially claimed a black man had abducted her kids and Clyburn saying that these are all white women who have made these charges against Conyers. What do you make of that outrageous claim  CAIN  Laura     INGRAHAM  Who care what color their skin is  CAIN  Color has nothing to do with it. They are trying to deflect the subject and to deflect the accusation. John Conyers is one of those situations where there is absolute proof that he did some of the things that he did. I mean  you take Senator Al Franken  you have a picture. It shows that he did some of the things that he was accused of. Now  you have got other situations where it s all accusations  speculation with no confirmation. We got confirmation with Representative Conyers. We got confirmation with Al Franken and we got confirmation with Charlie Rose. Those have confirmation and they have even admitted it  but you have got a lot of others out there based on accusations and speculation but no confirmation. INGRAHAM  What about this slush fund  Herman  in the House of Representatives where they are paying out     million. Some of them are not sexually related but apparently none of these Congressman knew about it and no one  as far as I know  I have interviewed in the House is demanding that the names be released of who was accused of what. Do you think that s important  CAIN  Yes  it s important. I believe now that come to light that Representative Conyers used that slush fund for some of the things he wanted to cover up. Yes. The American people and the voters and the taxpayers deserve an explanation. We didn t even know that this slush fund existed. INGRAHAM  No  no  Herman  none of these guys knew. It s a total scandal. It s great to see you back. Thanks so much for joining us. Up next  our exclusive with Senate Majority Leader Mitch McConnell trying to push that tax reform bill through the Senate and weighs in. You went believe what he says about the Alabama Senate race and sex abuse allegations on Capitol Hill all coming up.  COMMERCIAL BREAK  INGRAHAM  It is said that Senate Majority Leader Mitch McConnell has one of the toughest jobs in politics. Why  He has taken fire from both the left and the populist right  sometimes including yours truly on a daily basis. Early this evening  believe it or not  I sat down with him and he was nice enough to give an exclusive interview to  The Ingraham Angle  where he addresses a range of topics. The wave of sex harassment allegations rocking Capitol Hill  the Alabama Senate race and a lot more. But we began with the GOP s do or die tax reform push.  BEGIN VIDEOTAPE  INGRAHAM  Senator McConnell  thanks so much for joining us tonight. So  you just left the Senate floor. The battle is underway for tax reform. How is it looking  SENATOR MITCH MCCONNELL  R KY.  MAJORITY LEADER  Unanimous Republican vote to go forward with the tax bill. Hoping it will be unanimous at the end  but we all agreed to get started after a lot of negotiations. I m optimistic we are going to deliver comprehensive tax reform to the American people for the first time in    years. INGRAHAM  Now  Marco Rubio and Mike Lee kind of a last minute move are pushing for a hike in the corporate tax cut from    percent to    percent. And they then want to give more relief to lower income people with children. Where is that going to go and is that going to be a monkey wrench in your plan here  MCCONNELL  We ll see. I mean  it s open for amendment. There will be plenty of amendments both on the Republican side and the Democratic side. But what I think we have     percent agreement on  Laura  is that we want to do comprehensive tax reform for the first time since the second Reagan administration. You know  the dials may twist a little bit as we go along  but the core is middle class tax relief and making our businesses more competitive against other businesses around the world  and to keep our jobs here in this country. INGRAHAM  So Donald Trump originally wanted    percent  went up to    percent  and you re saying tonight it could go up to    percent after this is all over  MCCONNELL  My preference is    percent. The Senate is going to work its will. There are going to be plenty of amendments on both sides. I think the core effort here  middle class tax relief and keeping our jobs in the country are going to be intact at the end. INGRAHAM  Some of the headlines about what you are trying to do with tax reform. Just a couple  GOP s ugly secret. Tax plan would force a quarter trillion dollar cut in Medicare   .  trillion to the deficit is going to really hurt higher education. Going to make it more expensive college presidents say specifically on this quarter trillion dollar cut overtime and Medicare  going to force spending cuts on Medicare. MCCONNELL  That s  of course  completely false. INGRAHAM  How  MCCONNELL  It s not true. We are not touching Medicare at all in this bill. Not at all. And on the deficit question you raised  we would only have to grow four tenths of   percent over the next    years. Four tenths of   percent over the next    years to fill that   trillion  dollar gap that the critics keep saying is going to sit there as if the economy wasn t going to respond to this incredible relief. It s going to get from the burden of high taxation. Nonsense  INGRAHAM  You are not worried about the deficit. You think the growth spurred by these tax cuts     MCCONNELL  This is not going to be a deficit producing effort. INGRAHAM  Why didn t you guys go with a border adjustment tax that would have actually infused some more money into this process  You would have been able to get cleaner tax reform  cleaner tax cuts. Ryan was for it. Some people called it a value added tax. MCCONNELL  There was a lot of resistance to that  a lot  and it was sort of aired out by the House last year when we were in early discussions about this. I couldn t have passed it in the Senate. We have to deal with what can pass. I need    votes. We have    Republicans. We have all    who want to get to yes  but that was just not something I could sell in the Senate. INGRAHAM  John McCain has been kind of a thorn in the side of the Trump administration. They have had acrimonious relationship going back to the campaign. Right now  do you think he s the biggest obstacle to this getting to the ultimate        MCCONNELL  He voted to get on the bill. I know John McCain well enough to know he is not going to cast a vote on tax reform no matter how he may feel about the current occupant of the White House. INGRAHAM  You don t think that comes into play at all  MCCONNELL  I don t think so  no. INGRAHAM  Let s move on to some other issues because there is a whole bunch going on in the country right now. The Alabama Senate race is taking up a lot of oxygen in the political landscape. He is up now in the polls   percent. You favored Luther Strange. A lot of money went in to supporting Luther Strange. He didn t win. Roy Moore won. I actually supported Mo Brooks  but Roy Moore won. Now  of course  all these allegations against him. You said he should step aside. He may very well win this election. What does that say about your influence in the Senate  Does it have any implication for you  He wants to unseat you  he says. MCCONNELL  Well  President Trump and I were on the same side. We both supported Luther Strange even though you supported Mo Brooks. The people in Alabama decided to go in a different direction. December the   th they will get to decide who they want to send to the Senate and we will deal with that when that happens. INGRAHAM  So  if that happens  there are still are senators who say we could vote to expel him from the U.S. Senate. But what does that say to the state of Alabama  They have heard all the argument  you say you believe the women that came forward. I tend to think some of them are credible as well. But people of Alabama are hearing it all. MCCONNELL  They are going to make the decision in Alabama and     INGRAHAM  So  should you in the Senate then invalidate that by expelling him out  MCCONNELL  We will deal with the aftermath and the decision of the people of Alabama make on the December   th. INGRAHAM  So  I think it s a possibility he could be expelled from the Senate. MCCONNELL  I think there is a possibility he will have an ethics issue. INGRAHAM  An ethics investigation once he gets here. MCCONNELL  Yes. I think it s almost certain. INGRAHAM  How far back will those allegations    they go back like almost four decades  MCCONNELL  It will be up to the committee. INGRAHAM  There s a lot of ethics investigations going on. MCCONNELL  Unfortunately  yes. INGRAHAM  The Senate doesn t have any sort of funds like the House has one of those they are calling it a shush fund or slush fund to settle settlements     MCCONNELL  Are you talking about harassment cases  INGRAHAM  Yes. MCCONNELL  Well  we are taking a look at completely changing whatever the status quo is. I mean  we two weeks ago in the Senate passed a measure to require mandatory training. We got a bipartisan group of Republican and Democratic women in the Senate giving us advice about the next step and clearly the status quo is not acceptable. INGRAHAM  Well  Kirsten Gillibrand  who has been on this issue and it effects the military  junior senator from New York  she came out and she said well  Bill Clinton really should have  you know  basically resigned. I mean  isn t it a little Kirsten come lately on Bill Clinton  He was accused of raping Juanita Broderick. Kathleen Willey and Paula Jones  the list goes on. But now Democrats are kind of deciding to kick the Clintons to curve. Do you find that to be credible  political  What is it  MCCONNELL  Well  without relitigating all of that  the question is  what are we going to do now. We ve already passed a measure requiring mandatory training. Before the end of the year  there s high likelihood we are going to pass either another Senate rule or legislation to outline the best way to handle these kinds of cases in the future. Under any circumstances  whatever is passed  any member of Congress ought to be personally liable  personally liable for any for any case that he or she loses. INGRAHAM  Are you in favor of unmasking the names of those in any type of settlement group over in the House  MCCONNELL  Retroactively  INGRAHAM  Well  there is a whole bunch of people whose names are unknown. Even apparently to the congressman who is in charge of the committee that is supposedly oversees it. MCCONNELL  Well  Laura  I think my attitude about that I want to wait and see what the women of the Senate recommend on that and the other issues we are talking about. INGRAHAM  So  it could be possible that we will never learn. MCCONNELL  I want to see what the women of the Senate recommend on that issue. INGRAHAM  Why just the women of the Senate  I mean  doesn t everybody     MCCONNELL  I think they are in a very good position to take the lead. Some men are involved as the well on both sides.  END VIDEOTAPE  INGRAHAM  Up next  part two of my talk with Leader McConnell  including his strong response to those in the media questioning President Trump s mental fitness for office  and a possible government shutdown. And later  the media will not stop attacking Melania Trump. I m going to respond in a continuing angle you don t want to miss.  COMMERCIAL BREAK  LAURA INGRAHAM  FOX NEWS HOST  Welcome back. Questioning President Trump s mental fitness for office is becoming a vicious  relentless obsession of the left. So I asked Senate Majority Leader Mitch McConnell about that in part two of our exclusive interview tonight.   BEGIN VIDEOTAPE  INGRAHAM  Two different cable networks today  MSNBC and CNN  at different points in the day were raising serious questions  I mean  these are big league reporters  about the mental state of President Trump  implying  or not just implying  saying that he looks like he has early onset dementia. He is unstable. He is destructive. He is imbalanced at a time where we could very well be facing a war with North Korea. You ve had a lot of interactions with the president. Tell us about what you view his intellectual mental capacity   MCCONNELL  Those accusations are absolutely outrageous. I mean  I speak to the president on virtually daily basis  and I m involved with him all the time on all these issues. And that kind of accusation is totally baseless and outrageous.  INGRAHAM  It s so personal  and as someone    my father had dementia and it s personal to me. And yet these charges are being thrown around  a lot of people believe  as a precursor to perhaps a Democrat takeover in      and then ultimately a push to try to remove him from office. That feeling is in this building. The Democrats want to invalidate this election one way or another.  MCCONNELL  Look  I think those kinds of accusations are completely off base and irresponsible. Let s argue over the issues. We have different points of view. For example  the decision to get on the tax bill was totally partisan. Every Democrat said I don t want to do tax reform. Every Republican said I do. That s the appropriate area for us to have our discussions in public about the future of the country.  INGRAHAM  Moving on to the government funding  government shutdown. Chuck Schumer has actually said as much  that he would be willing to move to have the government shut down  he wouldn t blame himself  but have the government shut down over amnesty for DACA  the DREAMers. And  yet  in       he said this     BEGIN VIDEO CLIP  SENATOR CHARLES SCHUMER  D N.Y.  SENATE MINORITY LEADER  Don t hold the American people hostage simply because you re so sure you re right and everyone else is wrong.   END VIDEO CLIP  INGRAHAM  Would this be political suicide for the Democrats to shut the government down over amnesty for illegal immigrants   MCCONNELL  Yes. I think that would be a pretty dumb place for them to end up  and I don t think in the end they will end up there.  INGRAHAM  The president has said he is open to a DACA deal. Tom Cotton  Senator Perdue have this idea of the RAISE Act. They have a whole bunch of things in it  including ending chain migration  which is like a       issue. It s really not a political issue. Every Mexican who comes into the United States on average brings six family members. For over two green card holders or legal immigrants they bring in seven. So most Americans say that s too much. Would you tonight commit to making that part of any future DACA amnesty   MCCONNELL  Yes. I agree with Cotton and Perdue. The president has given us until March to deal with the issue of DACA. And the question is whether you are just going to do that and nothing else. I m in favor of doing something on the DACA front. These kids came here through no act of their own. I think they have a legitimate case to be made. But I don t think we ought to just do that. A chain migration  doing something about the diversity lottery  there are plenty of changes to the legal immigration system that should be added to any kind of a DACA fix that we do.  INGRAHAM  Do you think the election was a mandate on passing immigration policies that are geared more toward the American worker  Would you agree with that   MCCONNELL  I think clearly immigration  the president made that a front and center issue. The wall  which we are still trying to achieve for him  was only part of it. And I think there is a great interest in changing the legal immigration system.  By the way  I m sure you share my view that legal immigration is important. My wife  the secretary of transportation  came here at age eight not speaking a word of English. And legal immigration has been an important part of America for over     years  our entire existence. That doesn t mean you just let anybody in at any point  and it doesn t mean you tolerate illegal entries.  So the president has actually given us an opportunity here by saying he wants to fix DACA but he doesn t want it all by itself. He want something with it  and I think the kinds of things you and I are discussing that Cotton and Perdue are pushing are exactly what ought to be part of a solution.  INGRAHAM  The tweets today from President Trump  one about the sexual harassment case at NBC. Another he re tweeted Muslim videos where there are violence in them  and apparently the source was someone a lot of people in Britain think is kind of an unsavory figure. Do these tweets make it more difficult for you to get stuff done here in Congress   MCCONNELL  I m not going to critique the president s tweeting habits. There has been much discussion about that all year. It s his decision.  INGRAHAM  But Schumer and Pelosi didn t show up at the meeting  of course  yesterday. You had two empty chairs. I actually kind of liked the empty chairs  senator. I think that was actually clarifying.  MCCONNELL  It certainly keeps things lively.  INGRAHAM  I would be remiss if I didn t ask one other question  I m sorry. North Korea  this is getting extremely tense if it wasn t tense before. Would you urge the Senate to be able to vote on the use of force  military force  if we re  indeed  getting involved in the Korean peninsula again   MCCONNELL  Well  if it gets to that. I think the president is doing actually a great job. He is the first president to get the attention of the Chinese who are actually squeezing the North Koreans as we speak.  INGRAHAM  Are you hopeful we can avert war in the Korean peninsula   MCCONNELL  I am.  INGRAHAM  Senator  thank you for all this time. It s terrific. Come back soon.   END VIDEOTAPE  INGRAHAM  And up next  another Senate big wig. I will ask Marco Rubio about where he stands on DACA amnesty  and also why the Wall Street Journal today says he and Schumer could be working to kill the president s tax plan. He responds up next.  And I have a message for those in the media who continue to pile on Melania Trump. You re not going to want to miss it  so stay tuned.   COMMERCIAL BREAK  INGRAHAM  The big tax reform fight happening right now in the Senate  and one issue that kind of popped up and is a little bit surprising is the issue of further increasing the child tax credit. And it s actually being championed by one senator in particular  Republican Marco Rubio. And he has found himself kind of crossways with the White House and some conservatives as a result.   BEGIN VIDEOTAPE  INGRAHAM  Senator Rubio  thanks so much for joining us tonight. Exciting times with the tax reform on the horizon. Finally we are moving forward for real debate. I talked to Mitch McConnell earlier tonight. And he thinks he is going to be able to get this done. He is very optimistic. Tonight the Wall Street Journal has an editorial titled  The Rubio Schumer Amendment  Florida Republican tries to blow up the Senate tax reform.  What are you up to  you are going to blow up the Senate tax reform   SEN. MARCO RUBIO  R FLA.  They are wrong about it. Let me tell you what it is. It s very simple. It s the child tax credit. And it s designed to help working people. Who are the people that would benefit from this  Firefighters  members of the Armed Services  teachers  construction workers.  INGRAHAM  To get a child tax credit.  RUBIO  So what it is  a lot of people  because they make         a year  OK  they don t get to fully benefit from the child tax credit because they don t have a lot of income tax liability  but they pay payroll tax. They are the working people in this country that have been ignored and forgotten. They are the people that elected President Trump because they have been not just ignored but disrespected.  And all this says is you are going to keep more of your own money. That s what the amendment does. They actually say it s a disincentive to work. It s ridiculous. You can t even get the tax credit if you are not working. This is people making between         and         or         who would benefit greatly.  And by the way  if you look at the states would benefit the most  I think it s    of the top    states voted for the president in the      election. Why  Because working people raising children are the people that voted to elect the president with a very clear message that they sent us here to fight for them  not for the moneyed interests that controls Washington.  INGRAHAM  So I think President Trump initially wanted    and then it went to     the corporate tax cut. But now under your plan it would go up to   .  RUBIO  On the corporate side  a    percent corporate tax rate is    points lower than what it is now. The different between    and    would still make us third among the G   nations. It would still put us below the global average. There is no difference in growth between    and   .  INGRAHAM  Numbers don t matter   RUBIO  Yes  they do matter  but not in terms of growth. You are not going to see any less growth at    than you would at   . It still puts us lower in the world. It still ranks us third among the G  . And by the way  there is another way to pay for it.  INGRAHAM  It s      billion or so   RUBIO  About     billion.  INGRAHAM  They said      billion.  RUBIO  Well  here s why  because we want    INGRAHAM  It s a lot of money.  RUBIO  But it s not our money. It s not the government s money. It s the working people s money. These are welders. These are police officers. INGRAHAM  But they are getting a rebate for children  having children. What about people who don t have kids who are not making money  What about them  Why don t they get a break   RUBIO  But they also don t have the expense of raising children. What we are saying if you are raising children  if you make         a year and you re raising three kids  that money doesn t go nearly as far as if you re not.  INGRAHAM  But they are not paying taxes either  for the most part. They don t have much of a tax liability.  RUBIO  But they still qualify for all sorts of    INGRAHAM  Will you be willing to blow the deal up if they don t go to    percent   RUBIO  I don t want to blow up the deal because if there is no tax reform there is no vehicle by which we can fix this. And it already does go up to       . I have never talked about conditioning anything. I am saying this makes our tax reform more pro worker  which is where we need to be as a country.  INGRAHAM  Speaking of workers  you want to do a DACA deal by the end of the year.  RUBIO  It depends.  INGRAHAM  You would like to if possible. Do you think Donald Trump was elected to do a DACA amnesty before something like Obamacare repeal  Do you think that s why people turned out for him   RUBIO  We tried to do Obamacare repeal. As you say it failed unfortunately because we couldn t get our conference together.  Here is what I said. There is a difference between DACA and the DREAM act. If what they want to do  and the president has expressed an openness to this  is to do something like DACA but constitutionally that is temporary and acts as a bridge towards something more permanent. That s one thing. If what they want is to make a permanent change to immigration policy  it must be accompanied by permanent changes to security.  INGRAHAM  McConnell said he is open to ending chain migration  e Verify  moistly what Tom Cotton and Perdue is talking about tonight. Chain migration is really the problem. Are you going to commit to chain migration  ending chain migration   RUBIO  Yes. We have in the past. We said it should be limited to immediate family. We ve always said it should be a merit based system of immigration. We ve always said that we need border security  including the wall  and entrance exit tracking system  e Verify  these are all things we have long supported. The debate is do you link it  the Democrats don t want to  do you link it to anything else on immigration. My answer is     INGRAHAM  Trump s election result was a mandate to change this approach and really focus  as he said  on the American worker  who has been hammered by lousy immigration policy.  RUBIO  And again  that s why I support a merit based immigration system  which by the way is also a reality in the   st century. Our economy is fundamentally different than it was     INGRAHAM  The Roy Moore issue is out there. He is up in the polls. He may very well win this race. What happens if he wins and he comes to Washington  they people of Alabama made his own call  it s not our call  it s their call  are you in favor of an ethics investigation that could perhaps lead to two thirds of the members expelling him   RUBIO  Well  first of all  there is an ethics investigation. That s the first thing. I don t even know how you initiate that.  INGRAHAM  Senator McConnell was also very open to that.  RUBIO  Well  assuming that that happens  and people would obviously make their decisions based on the facts that emerged from it. I think what s complicated about it  and I have said this publicly before  to be frank  I find the accusations against him to be credible. And I don t think anything he has said or done in the last couple weeks has helped him in that regard. That said  this information is before the voters of Alabama. And if they elect him and then you as a Senate have ethics hearings to remove him from office or something like that  that gets more complicated. That s a little bit more difficult because voters will have this information before them when they vote for him if  in fact  he is elected.  INGRAHAM  This issue of government shut down. Chuck Schumer has said in the past        no government shut down for policy. This is ridiculous. Do you think he would actually shut the government down if he doesn t get his DREAMer     RUBIO  I don t it would be very popular. I don t think you can or should shut the government of the United States down over that issue. I just don t think you can or should. I think there would be a massive revolt  even perhaps within his own conference.  INGRAHAM  And finally  this House shush slush fund victims  for a bunch of things  especially settlements  is there any fund like that in the Senate that you re aware of   RUBIO  I don t know. I m not aware of it. There probably is. I have never used it obviously. But I think that should be made public. That s taxpayer money.  INGRAHAM  So you will say tonight that these people should be unmasked  We should know who these people are in the House who settled  or the Senate if there is such a fund  and we should know who they are   RUBIO  Absolutely. It s public money. It s not their money. One thing is if you settle with your own money. But if it s taxpayer money  taxpayers deserved to know.  INGRAHAM  It s great to have you on tonight.  RUBIO  It s good to be with you.  INGRAHAM  Thank you so much for coming on. I appreciate it. RUBIO  Thanks for having me.   END VIDEOTAPE  INGRAHAM  Note he said there probably is a similar fund in the Senate  another slush fund.  Up next  new attacks from the Grinches on the left against Melania Trump and her Christmas kickoff at the White House which was so beautiful. Guess what  I m not letting them get away with that  next.   COMMERCIAL BREAK  INGRAHAM  Melania Trump and the Grinches that want to steel Christmas  that s tonight s continuing angle.  The geniuses at The Daily Beast have now joined the rest of the left wing snipers trashing Melania s Christmas decorations. They are claiming that they give us insight into Melania s state of mind. Erin Gloria Ryan writes  Christmas at the White House will be both sad and hilarious as most of Melania s demonstrative disdain for her job is. Melania s corridor of holiday sadness has given us a nice preview of what the world will look like post nuclear holocaust.   Do you know what holiday sadness is  Attacking a woman of impeccable taste for decorating the White House with an eye for tradition and class. You know what the left hates  The left hates a traditional  Godly celebration of Christmas. That s what Melania Trump is bringing back to the White House this year. All they can do is snipe and criticize. The double standard with Michelle and their continuing deification of her is obvious.   COMMERCIAL BREAK  INGRAHAM  Before we go  a great Christmas gift  of course  the new book  Billionaire at the Barricades  The Populist Revolution from Reagan to Trump.  Learn about how Trump got into the White House in the first place. It didn t happen overnight. It was a long trail of populist fights that got him there. And that s all the time we have tonight. Shannon Bream takes things from here. Shannon      Content and Programming Copyright      Fox News Network  LLC. ALL RIGHTS RESERVED. Copyright      CQ Roll Call  Inc. All materials herein are protected by United States copyright law and may not be reproduced  distributed  transmitted  displayed  published or broadcast without the prior written permission of CQ Roll Call. You may not alter or remove any trademark  copyright or other notice from copies of the content.    This material may not be published  broadcast  rewritten  or redistributed.       FOX News Network  LLC. All rights reserved. All market data delayed    minutes.","Senate Republicans narrowly passed a bill to overhaul the American tax system in the wee hours of Saturday morning  navigating party fractures to approve a plan that lawmakers were still scraping together in the hours before the vote. With the       vote  the GOP leaps closer to its promise of dramatically remaking U.S. tax law under a Republican led government. Republicans see changing the tax code as crucial to their electoral success after GOP opposition sank attempts to repeal the Affordable Care Act. The GOP still needs to overcome significant disagreements for the House and Senate to craft a joint bill and send it to President  Donald Trump  s desk. Republicans hope to reach a deal by Christmas  a quick timeline considering the differences in their plans. Following the vote  Trump tweeted that Republicans were  one step closer to delivering MASSIVE tax cuts  and said he wanted to sign a bill by Christmas.     Last minute changes to the Senate plan won over multiple skeptical Republicans on Friday   a day after a policy roadblock threatened to slow the bill s momentum. The GOP did not release the final version of the broadly unpopular bill until Friday night. The surprise GOP  no  votes to sink the party s policy goal never surfaced  unlike in September when Sen.  John McCain   R Ariz.  turned his thumb down on the Senate floor to quash Republican hopes of repealing Obamacare. A GOP sprint to finish and approve the bill sparked backlash from Democrats  who shared videos of themselves parsing through the     page legislative text  which featured handwritten changes. Senate Minority Leader  Chuck Schumer   D N.Y.  accused his counterparts of  descending to a new low of chicanery.   After the bill s passage  Senate Majority Leader Mitch McConnell  R Ky.  downplayed the Democratic concerns about the process.   You complain about process when you re losing  and that s what you heard on the floor tonight   he said.  Republican leaders had to balance varying concerns within the party to approve the plan. Multiple senators had fears about the estimated    trillion in budget deficits an earlier version of the bill would generate  even after economic growth is taken into account. Only one of those lawmakers  outgoing Sen.  Bob Corker   R Tenn.  ended up opposing the plan. After the bill s passage  McConnell said he was  totally confident  it would be revenue neutral or even increase the amount of revenue the government holds. The official congressional scorekeeper estimated it would come nowhere close to generating revenue.  Two senators    Ron Johnson   R Wis.  and  Steve Daines   R Mont.   backed the plan after winning deeper tax breaks for pass through businesses. Sen.  Susan Collins  supported it after leadership added a limited state and local property tax deduction and expanded a medical expense deduction.  The bill would now also include a form of the alternative minimum tax  which the initial plan scrapped.  Senate Republicans balanced those sometimes competing concerns  along with Senate budget rules  without losing three senators  which would have killed the legislation. Doing so took some unpopular moves. Most individual tax reductions under the plan would expire within a decade. A corporate tax cut to    percent from    percent will be permanent. Democrats seized on those provisions. They cited them as more evidence that the bill helps corporations and wealthy individuals at the expense of low  and middle income taxpayers. The Senate also voted to scrap Obamacare s individual mandate  which would lead to roughly    million more people uninsured and average premiums rising about    percent  according to Congressional Budget Office estimates. The measure saved more than      billion to allow senators to cut taxes more deeply and stay within budget rules. All three GOP senators who knocked down Obamacare repeal   McCain  Collins and Sen. Lisa Murkowski  R Alaska   ended up backing a tax bill that would repeal the mandate. The Senate and House will now likely go to a conference committee. Lawmakers will aim to craft a joint bill that both chambers can pass. The chambers will face a challenge in coming to a consensus on several key policies. Importantly  the Senate   only hours before the vote   added up to         in state and local property tax deductions to its plan  matching the House bill. GOP House members in high tax blue states largely oppose scrapping the popular provisions  which the initial Senate proposal would have done. Senate Republicans  who have no members representing states like New York  New Jersey and California  have no such political dilemma. Thirteen Republicans   all of whom represent New York  New Jersey or California   voted against that House plan. The chambers will have to resolve differences in the number of tax brackets and the rates income groups pay. They will need to settle differences on how to treat pass through businesses  the estate or so called  death  tax and the mortgage interest deductions. While attempting to agree on a plan  Republicans will also have to face a public opinion problem.  Forty nine percent of people aware of the tax proposal opposed it   while only    percent said they supported it  according to a Reuters Ipsos poll released Wednesday. Earlier in November     percent of voters said the plan would mainly help the wealthy   according to a Quinnipiac poll . Fifty nine percent responded that it favored the rich at the expense of the middle class. Only    percent of taxpayers would see their taxes fall by more than      in       according to an   analysis by the congressional scorekeeper Joint Committee on Taxation shared with The Washington Post . By       when most individual reductions expire  only    percent of Americans would have taxes cut by more than       the committee projected.        Playing Share this video... Watch Next...","     More News       Password has been successfully updated. We have sent you an email with a link to change your password. We didn t recognize that password reset code. Enter your email address to get a new one. We ve sent an email with instructions to create a new password. Your existing password has not been changed. Sign in using your WHIO TV profile Need a profile   Register now.  Sign in using your WHIO TV profile Need a profile   Register now.  Sign in using your WHIO TV profile Need a profile   Register now.  By submitting your registration information  you agree to our  Terms of Service  and  Privacy Policy . We have sent you a verification email. Please check your email and click on the link to activate your whio.com profile. If you do not receive the verification message within a few minutes of signing up  please check your Spam or Junk folder. We look forward to seeing you on whio.com frequently. Visit us and sign in to update your profile  receive the latest news and keep up to date with mobile alerts.            Click  here  to return to the page you were visiting.            Don t worry  it happens. We ll send you a link to create a new password. We have sent you an email with a link to change your password. Click submit to receive another verification email Check your email for a verification link Don t worry  it happens. We ll send you a link to create a new     password. Created on     display created    Last login     display lastLogIn            Change My        Password                     Senate Republicans edge towards approval of GOP tax reform bill              Michael Flynn pleads guilty to lying to FBI in Russia probe  Live updates              With flurry of late changes  Senate passes GOP tax reform bill              Michael Flynn charged in Russia investigation    things to know              Michael Flynn pleads guilty to making false statements to FBI on Russia probe              Senate Republicans edge towards approval of GOP tax reform bill              Michael Flynn pleads guilty to lying to FBI in Russia probe  Live updates              With flurry of late changes  Senate passes GOP tax reform bill              Michael Flynn charged in Russia investigation    things to know              Michael Flynn pleads guilty to making false statements to FBI on Russia probe     Published   Thursday  November                 AM                By                                                     Staff Writer               Jamie Dupree      With the final details of a GOP tax reform bill still in flux  the U.S. Senate voted Wednesday evening to begin debate on             the Republican plan  setting up an expected final vote on the measure by the end of the week  as GOP leaders joined the President             in promising to pass a sweeping package of tax cuts and reforms by the Christmas break.             It s a once in a generation opportunity   said Sen. Rob Portman  R OH  on the Senate floor.  The last time we reformed our             tax code in any substantial way was    years ago.              Passing tax reform is the single most important thing we can do right now  to shift the economy into high gear   said Senate             Majority Leader Mitch McConnell.            The Senate vote on a motion to start debate on the bill fell right along party lines  as despite some concerns about the             details  GOP Senators stuck together on the first test vote on tax reform.             I think we re going to get to common ground and get this bill passed   said Sen. David Perdue  R GA .  I don t want to see             this bill destroyed because of a pursuit for perfection.                                      Republicans had one very good sign after that first Senate vote was over  as Sen. Lisa Murkowski  R AK  expressed her strong             support for the GOP plan  which includes a provision that would open up an area in the Alaska National Wildlife Refuge   ANWR               to oil and gas production  something long sought by Republicans.             The bill before us has a number of features that are very attractive to Alaskans   Murkowski said in a statement  seemingly             securing a key vote in favor of tax reform.            Republicans can only afford to lose two votes in the Senate  a       tie could still be broken with the vote of Vice President             Mike Pence  who had dinner Wednesday evening with some of those still on the fence.            But GOP Senators were still trying to hash out some of the details  some like Sen. Marco Rubio  R FL  wanted a larger child             tax credit  as Rubio joined Sen. Mike Lee  R UT  in filing an amendment that would pay for that larger credit by trimming             back the plan s signature corporate tax cut.             The corporate tax rate in the United States is    percent   Rubio said on the Senate floor.  We would reduce that to                percent   while the current GOP plan is at    percent  something that s been a red line for President Donald Trump.             There are a lot of good things in this tax bill  but we can make it better   Rubio said. This week  the Senate can join the House  amp amp  take a strong stand for the Middle Class families who are the backbone of America.                   Together  we will give the American people a big  beautiful Christmas present a massive tax cut that lets Americans keep more                   of their HARD EARNED MONEY                      pic.twitter.com  jddEW Oo                     Donald J. Trump   realDonaldTrump                      November                                                            As for the final details of the Senate tax reform plan  those still were not available as Washington  D.C. went to bed on             Wednesday night  GOP leaders filed the     page Senate bill  but were still working out the last minute changes to the plan.            Democrats complained bitterly about the process  but with only    votes  they still need GOP defections to defeat the plan.   It s not what the American people want   said Sen. Bill Nelson  D FL .  It s what large corporations want.    Let s stop this bill   said Sen. Michael Bennet  D CO .  This bill doesn t deserve to be on the Senate floor  it s a disgrace.  Here s my idea for a REAL middle class tax cut  get rid of the GOP s new tax breaks for millionaires and big corporations                   and let s give a        refundable credit for everyone earning under     k.                   Senator Jeff Merkley   SenJeffMerkley                      November                                                            Democrats were putting together their own amendments to offer on the floor  but Republicans seemed ready to block them with             a united GOP front.             People really want to get to  yes  on this   said Sen. Jim Risch  R ID .  And Republicans seem to be on the verge of doing that in the U.S. Senate as soon as Thursday night.     Published   Friday  December                 AM     Updated   Saturday  December                  PM                By                                                     Cox Media Group National Content Desk              WASHINGTON                   President Donald Trump s former national security adviser  Michael Flynn  pleaded guilty Friday to  willfully and knowingly  lying to the FBI in Special Counsel Robert Mueller s investigation into possible Russian interference in the      election.     gt  gt  Read more trending news        gt  gt  More on Robert Mueller s investigation     Flynn lied to investigators in January about conversations he had in December      with Russia s ambassador to the U.S.  Sergey Kislyak  according to court documents released Friday. WATCH  Flynn arrives at the U.S. District Court in Washington DC  pic.twitter.com svWWILvLHL  Read the document released Friday      Flynn Information  by  National Content Desk  on Scribd     Published   Saturday  December                 AM                By                                                     Staff Writer               Jamie Dupree      In another big step forward for Congressional leaders and President Donald Trump  Republicans muscled a sweeping tax reform             bill through the Senate early on Saturday morning  setting up House Senate negotiations starting next week  as the White House             pressed lawmakers to strike a final GOP deal in coming weeks  with a goal of getting the bill to the President s desk by Christmas.             This tax bill is going to ignite our economy   said Sen. David Perdue  R GA .  It s going to be extremely stimulative.    The vast majority of middle class families are going to get a tax cut   said Sen. Rob Portman  R OH .  I don t know what s             wrong with that.             The vote in the Senate came after several days of closed door negotiations among Republicans                as they made a number of changes to the bill  making sure there were enough GOP votes .             Over the past    hours  I think we ve made a really great bill even better  with more middle class tax relief  and more             relief for small businesses   said Sen. John Thune  R SD .             The final tally was      . Only Sen. Bob Corker  R TN  broke ranks  as he joined all Democrats in voting against the GOP             bill. Corker argued it would add too much to the federal deficit.                                     The bill now goes to House Senate negotiations  which are expected to begin next week. The GOP goal is to work out a final             deal by the holiday break.            With no summary of the new provisions available  observers were scrambling their way through the revised bill  to figure             out what changes had been tucked into the GOP measure. Among the changes proposed in the Senate bill               The Senate plan modifies the current seven income tax brackets  creating rates of                              and   .  .    The Senate bill increases the standard deduction to make up for the repeal of individual itemized deductions  for state             and local taxes.              A late change in the bill was made to include an up to         deduction for state and local property taxes  identical             to a provision in a House passed bill.              The Alternative Minimum Tax was originally eliminated by the Senate bill  but Friday s revisions now brought it back to             life  both for individual and corporate taxpayers. This is at odds with the House  which totally eliminated the AMT.              Another item eliminated by the House  but revived in the Senate  was the Medical Expenses deduction  though it would live             on for only two years under this plan  people would be allowed to deduct expenses when they reached  .  percent of a person s             adjusted gross income  as opposed to the current    percent threshold.              Pass through income would see a deduction of    percent of income  up from   .  percent  a big win for small businesses.    Just after midnight  Vice President Mike Pence broke a       tie to               approve an amendment from Sen. Ted Cruz  R TX   which allows people to set up a     college savings account for home school                students                and use it to cover K    expenses.             On the Senate floor  Democrats were reduced to frustrated legislative bystanders  unable to change the bill in any manner              as they decried the rush as a brazen political power grab by the GOP on taxes.             It sure looks like the lobbyists have been working overtime   said Sen. Jeff Merkley  D OR   as Democrats ridiculed a rough             draft of the final bill  which contained handwritten scribbles and changes in the margins  some of which were difficult to             decipher.                                                                               I was just handed a     page tax bill a few hours before the vote. One page literally has hand scribbled policy changes on                   it that can t be read. This is Washington  D.C. at its worst. Montanans deserve so much better.                     pic.twitter.com q lTpXoXS                     Senator Jon Tester   SenatorTester                      December                                                           But with only    votes   and just one Republican defection on the final vote   Democrats were unable to do anything but complain             about the     page GOP tax reform plan.             There is no possible way that any member of this body has read all of that   said Sen. Chris Murphy  D CT  in a somewhat             incredulous tone.  There is no way.             Democrats did register one win in the late night votes on amendments to the tax reform bill  as with the help of four Republicans              the Senate voted       to strike a provision championed by Sen. Pat Toomey  R PA  that would have set out a narrow exemption             from a GOP plan to slap excise taxes on college endowments.             Toomey s plan would have applied to colleges that don t take federal funding of any type  and have small student populations              but a sharp backlash attracted four GOP votes  and scuttled that provision.             The tax reform bill now goes back to the House  which is ready to ask for a joint House Senate conference committee to hammer             out a final compromise. That procedural vote is expected on Monday evening.               Published   Friday  December                  AM     Updated   Friday  December                  AM                By                                                     Joy Johnston  Cox Media Group National Content Desk              WASHINGTON                   President Donald Trump s former National Security Adviser Michael Flynn has been charged by Special Counsel Robert S. Mueller III with making false statements to federal investigators. He nbsp  pleaded guilty  in a federal courthouse in Washington Friday. Here s what we know about the Michael Flynn investigation    .  What has Flynn been charged with   Flynn has been charged with one count of lying to the FBI. The count encompasses two separate instances of lying to FBI investigators.  nbsp    Read the court charging document.     .  What incidents prompted the charge   Two separate conversations with then Russian ambassador Sergey Kislyak in December       and Flynn s misrepresentation of those conversations to the FBI in January prompted the charge  according to the documents filed by the special counsel. The December conversations involved Russian sanctions and a vote on a United Nations Security Council resolution  according to the special counsel s court filing.     gt  gt  Read more trending news      .  Is the Flynn charge a surprise   The charge is not a surprise to many legal experts. Flynn has been under investigation for months. Just this past week  Flynn s legal team told Trump s legal team they could no longer share information. This move seemed to indicate that charges  and or a plea deal  was in the works.   .  What happens next   Flynn has pleaded guilty Friday to one charge of lying to the FBI  the nbsp  New York Times reported . It is not known at this time what punishment may be levied  or if there is a cooperation agreement in the works. Flynn released a statement about the charge  acknowledging that his actions outlined in court documents were wrong  and that he accepts full responsibility for his actions. NEW  Flynn s statement about guilty plea.  pic.twitter.com  y kgcTReA  It also is not known at this time if Flynn s son  Michael Flynn  Jr.  will face any charges. Flynn and his son worked closely together. nbsp  The Washington Post  is reporting that Flynn Jr. is not expected to be charged  as part of the Flynn plea agreement.   .  What is the White House s response    Trump s legal team issued a formal response to the Flynn charge and guilty plea. WH lawyer Ty Cobb on Flynn   Nothing about the guilty plea or the charge implicates anyone other than Mr. Flynn.    Also refers to Flynn as a  former Obama administration official   pic.twitter.com Se  P tXd       Published   Friday  December                  AM                By                                                     Staff Writer               Jamie Dupree      Former National Security Adviser Michael Flynn plead guilty on Friday to one felony count of making false statements to the             FBI  as Special Counsel Robert Mueller s investigation into Russian meddling in the      elections reached into the inner             circles of President Donald Trump s administration  as Flynn admitted that he did not tell the truth about conversations he             had with the Russian Ambassador to the United States.             My guilty plea and agreement to cooperate with the Special Counsel s Office reflect a decision I made in the best interests             of my family and of our country   Flynn said in a written statement.             I accept full responsibility for my actions   Flynn added  as he became the first member of the Trump Administration to             be charged  and plead guilty to charges related to Mueller s probe.           BREAKING  Ex Trump adviser Michael Flynn admits in plea deal that Trump transition officials directed his contacts with the                   Russians.                   AP Politics   AP Politics                      December                                                                                                                                                    nbsp  Cox Media Group .  By using this website  you accept the terms of our  Visitor Agreement  and  Privacy Policy   and understand your options regarding  Ad Choices . This station is part of Cox Media Group Television. Learn about  careers at Cox Media Group ."," Supported by     Want to see your name here  Donate Now   Peter Suderman     Jun.               pm     KEVIN DIETSCH UPI Newscom  Despite being billed as an Obamacare repeal plan  the health care bill released last week by Senate Republicans kept many of Obamacare s core elements in place  including federal regulations restricting health insurers from charging based on preexisting conditions and income based subsidies for individuals purchasing health coverage on the individual market. But it lacked one of Obamacare s notable features the individual mandate to purchase health insurance. From a political perspective  this was not surprising. Republicans have spent the last seven years criticizing the health law s mandate. But as a matter of policy  it was an unusual decision  Over the last several decades  several states have attempted to implement preexisting conditions regulations without a mandate. Every single one has seen their individual insurance market melt down in the space of a few years. With regulations but no mandate  people wait until they are sick to buy coverage  meaning that health insurers end up covering a smaller group of sicker people. This raises premiums  which pushes healthier people out of the market  which raises premiums further  and the cycle continues until premiums are unaffordable and insurers  unable to make money  leave the market  in other words  a death spiral. This afternoon  Senate Republicans updated their health care bill  the Better Care Reconciliation Act  BCRA   to include  a provision  that is not a mandate  but is intended to act as a substitute for it. It s a backdoor mandate a workaround designed to fulfill the same function. It s another sign of how much of Obamacare s individual market design Republicans have borrowed for their own bill. Instead of a fine for going uncovered  as in Obamacare  the Senate GOP bill now includes a continuous coverage provision  Anyone who goes without coverage for more than    days must wait six months before getting coverage again. The goal  as with the mandate  is to create an incentive for health people to buy coverage and maintain it  by penalizing if they don t. It doesn t take too much work to imagine how a provision like this might end up being weakly enforced  if only for political reasons.   Obamacare already includes an open enrollment period  outside of which people are not allowed to buy coverage at least in theory. In practice  there are numerous exceptions  and insurers have complained that those exceptions have allowed large numbers of people to jump on and off health plans throughout the year  obtaining coverage only when sick. In turn  insurers respond by raising premiums. If the six month waiting period goes into effect  it s likely to lock some sick people out of coverage  and the result could be the creation of loopholes that weaken the provision s effectiveness. It s one of the many flaws inherent in the design of both Obamacare and the Senate bill  The political unpopularity of the mandate  and of mandate alternatives like this  makes it difficult to maintain the regulatory balance that is supposed to make the whole system work. In any case  it s one more way in which the health care bill put forward by Senate Republicans resembles a skimpier version of the bill it is supposed to repeal  and further evidence that Republicans aren t repealing the health law so much as putting their own awkward stamp on it.   Peter Suderman  is features editor at  Reason .          Follow Peter Suderman on   Twitter       Media Contact   Reprint Requests   Please Support Reason s      Webathon Today    Peter Suderman       .  .     Damon Root       .  .     Jim Epstein       .  .     Editor s Note   We invite comments and request that they be civil and on topic. We do not moderate or assume any responsibility for comments  which are owned by the readers who post them. Comments do not represent the views of Reason.com or Reason Foundation. We reserve the right to delete any comment for any reason at any time. Report  abuses .  JFree       .  .         PM         This resembles nothing more than GOP shoving spinach around the plate to waste time in hopes that they can finally get permission to do what they really want to do   deliver goodies to the donor class in order to get their fundraising back up for the      election.  log in  or  register  to reply   WakaWaka        .  .         PM          The business of Progressives is to go on making mistakes. The business of Conservatives is to prevent mistakes from being corrected   Chesterton  log in  or  register  to reply  Teddy Pump       .  .         PM         GREAT QUOTE      log in  or  register  to reply   Michael Hihn        .  .         PM         Clarifies that today s conservatives are a massive fucking failure  who continue to get their asases kicked on almost everything by progressives.  log in  or  register  to reply  Citizen X            .  .         PM         Christ  what assholes.  log in  or  register  to reply  some guy       .  .         PM         If only we could comment at the blog level rather than only at the thread level  you wouldn t have to repeat yourself in every article...  log in  or  register  to reply   Michael Hihn        .  .         PM         In fairness  not every article reports the abject stupidity of today s GOP.  log in  or  register  to reply   Hugh Akston        .  .         PM         I have it on good authority from reliable sources that the AHCA is good because it repeals the individual mandate AND NOTHING ELSE HAPPENED.  log in  or  register  to reply  Mithrandir       .  .         PM         You must have been talking to Ken.  log in  or  register  to reply   Hugh Akston        .  .         PM         You don t so much  talk to  Ken as find yourself lulled into a coma by a neverending stream of repetitive droning by Ken.  log in  or  register  to reply  Citizen X            .  .         PM         He s actually pretty clever. Once you re in a coma it s the perfect opportunity for him to go through your wallet. Well  not  yours  specifically  Hugh. As we all know your wallet contains nothing but flower petals and partially chewed Nicorette.  log in  or  register  to reply   Hugh Akston        .  .         PM         I also have a Pluto Nash promotional condom.  log in  or  register  to reply   Crusty Juggler is bae.        .  .         PM         I m listening...  log in  or  register  to reply   Michael Hihn        .  .         PM         Ken says the exact opposite    whenever he gets his tongue out of the GOP s ass.  log in  or  register  to reply          l     a  l        l        l         l            l            l           l           l            l            l           l            l            l           l            l           l            l            l           l           l           l            l           l            l         l      o  l      t  l      l  l      i  l      a  l      m  l         l         l      f  l      e  l      r  l      h  l         l      a  l            i i      if  l i .substring               document.write      unescape l i .substring            else document.write unescape l i                      .  .         PM         Better Assistance Reconciling Affordable Care and KKKongress Act  log in  or  register  to reply  BYODB       .  .         PM            Over the last several decades  several states have attempted to implement preexisting conditions regulations without a mandate. Every single one has seen their individual insurance market melt down in the space of a few years.     Look  this is never going to work without a mandate. The popular parts of the bill make the unpopular parts of the bill  necessary . That s a given.   This is proof positive that what the public wants is impossible in the form that the public wants it. Instead of saying  no  it s impossible  lets do what we know works  the Republicans cave to the idiots and take ownership of a program that will inevitably destroy our health system.   Kudos  assholes  for not doing the  one thing  you were elected to do   no one  was saying  repeal and replace  until after they won back the majority presidency . While it s certain they don t have the votes to do what they promised  this is pretty literally the opposite of doing what they said. That can t be ignored  while doing  nothing  would have at least been honest.   It appears the Republicans are now the evil party  and Democrats have become the stupid party. Nice. That happens  from time to time.  log in  or  register  to reply  JFree       .  .         PM          Look  this is never going to work without a mandate.  which is exactly what every other country on Earth has discovered about healthcare. The difference is that most others have realized that if you have to mandate  then do it directly via taxes and overt rationing of the tax paid stuff   not via some cronyist pricing distortion of  insurance .  log in  or  register  to reply  mortiscrum       .  .         PM         Singapore  brah  It s hard to call what they re doing free market  actually  it s impossible to call it that   but it s not like any other single payer plan either. It s very interesting. I learned the other day that there s only   countries where the government completely controls healthcare  Canada and the UK. Everyone else still has private insurance companies playing a major roll  usually along with a bare bones singe payer option  or something that acts like it .  log in  or  register  to reply  Ankah       .  .         PM         Do you think what Singapore is doing could scale  I think a lot of what they do works because of the size. Yew also conditioned that whole country in a very particular way.  log in  or  register  to reply  mortiscrum       .  .         AM         I don t know. I ve heard economists say  don t use Singapore as a model for anything   since it s so anomalous is so many ways. Honestly  even if what they re doing would scale  I think it d be politically impossible to use here. The reason I bring it up is I think there s lots of interesting ways to approach healthcare. It s not just    What we re doing now     No rules  completely free market  or    single payer.  log in  or  register  to reply  BYODB       .  .         PM            It s a backdoor mandate a workaround designed to fulfill the same function. It s another sign of how much of Obamacare s individual market design Republicans have borrowed for their own bill.   Anyone who goes without coverage for more than    days must wait six months before getting coverage again. The goal  as with the mandate  is to create an incentive for health people to buy coverage and maintain it  by penalizing if they don t.   And  for the record  this is miles different than the government claiming that it can force you to buy a particular product just because you happen to be alive.  log in  or  register  to reply   Michael Hihn        .  .         PM         How   log in  or  register  to reply   Curt            .  .         AM         No penaltax   log in  or  register  to reply   Michael Hihn        .  .         PM         He confused guaranteed issue with the mandate.  log in  or  register  to reply   Priscilla King        .  .         PM         Well...if you don t believe in supporting the whole insurance scam  with this version you re free to opt out  you just have to be willing to stand on principles. No saying  I don t  want  insurance  while you re healthy and then slithering back around to  Ooohhh  I just discovered I have something that s likely to be expensive  sign me up for insurance please.  Those who want to hold out for a cash based system have to be willing to  hold out  for one. Not a problem here  I just want to see more provision for moving the whole country back to the cash based system  before the insurance rip off bankrupts all of us.  How does it work  Same way a book that would cost     as a regular book suddenly jumps up to      minimum if it s listed as a required textbook for a college course. College students are spending federal grant money  so there s no incentive to keep costs reasonable. Likewise  when a critical mass of customers rely on insurance rather than paying for treatment themselves  the cost of medical treatments skyrockets. We could  all  benefit by just saying no to the whole insurance racket.   log in  or  register  to reply  BearOdinson       .  .         PM         I will never disagree with the propositions that      so many Republicans in the Senate and the House are spineless weasels  and     the majority of them are equally statist  just sometimes for different things . However  I have to continue to point out  that the reason the House and Senate keep producing shitty bills  is because the Dems  along with the  moderate  Reps  can stop anything more substantive from even getting an up or down vote. Should the few Senators and Congressman who really are for repealing Obamacare simply vote  no  on anything else  As most of us predicted  once the abortion known as  Obamacare  was passed  it was going to be difficult or impossible to get rid of. So for once Suderman  please place the blame where it belongs      Obama      The Dems who passed it  and     The Dems and squishy Reps who won t do anything substantive and positive to get rid of it.  log in  or  register  to reply  ThomasD       .  .         PM         LOL. He ll get  right on  that.  log in  or  register  to reply  some guy       .  .         PM         We really need a legislation sunset amendment. I think we could also benefit from requiring large supermajorities for anything to pass in the first place. If the vast majority of the nation isn t on board  then it shouldn t be able to pass. That way you don t end up with      of the population constantly trying to push the other      around.  log in  or  register  to reply  mortiscrum       .  .         PM         I m not so sure making even more Byzantine rules to slow down the speed and efficiency at which government moves is going to lead to good outcomes. I find it much more plausible that it just greatly exacerbates all of the existing problems.  log in  or  register  to reply  some guy       .  .         PM         What problems would be exacerbated  Laws would only pass and persist if they enjoyed strong bi partisan support. A lot of major regulations would sunset over the next few years. The war on drugs would end.  log in  or  register  to reply  mortiscrum       .  .         PM         If people actually want more bipartisan efforts  why do so many people use compromise as a dirty word  People get fed up with the general slowness of government  and being promised things in elections that never come to pass. So they elect more ideological  more rigid  crusaders  who theoretically won t go back on stated positions.  The last person was a  democrat or republican  In Name Only  They compromised away their stated ideals for whatever whatever  What we need is a real  democrat or republican   . The newly elected  won t give up politician goes to Washington and runs right in to democracy  compromise  trading this for that  and not quite delivering what they said. And the cycle continues. I think the auto sunset rule is really interesting. Accumulation of regulation and outdated programs is definitely a problem. Supermajorities to pass anything worries me though   I do think the dynamic I described would become a lot worse.  log in  or  register  to reply  marshaul       .  .         PM         Virtually every conceivably needed piece of legislation was passed decades  if not centuries ago. The only thing government needs a quick pace in doing at this point is repealing laws. Auto sunset takes care of that for it. And no  most people aren t sitting around desperately waiting for government to  get to it . Most people ignore government  except to the extent that partisan political affiliation is part of their identity.  log in  or  register  to reply   Michael Hihn        .  .         PM         Because compromise is totally stupid. Nobody storms the barricades so they can surrender. So it s totally useless for bipartisan solutions. The best way toward that is win win. And the very best at it was ... Ted Kennedy. He was the poster child for American liberalism  but NOT an ideologue. Much landmark legislation was co authored by him and an equally influential conservative  often Hatch. They d go off together    only two    never a committee or commission    and work out a deal where the both won    on net    without paying too high a price. Then each go sell it to their own party. For one example  when Cato and other hysteria freaks entice your dollars by saying employer paid health care means you can lose coverage when changing jobs with a pre existing condition  they re fill of shit  Portability when changing jobs has been guaranteed since      by ... Ted Kennedy ... and Senator Nancy Kassebaum  R KS   log in  or  register  to reply  mortiscrum       .  .         PM         I don t understand your distinction between compromise and  win win.  Yeah  it s great when two people or groups can come to a solution that they both like  but it s wildly unrealistic to think that s possible in every situation. Most situations require both negotiators to give up something they want   possibly even something they went in to the negotiation telling themselves they d never give up. Such is life  and such is politics.  log in  or  register  to reply   Michael Hihn        .  .          PM         You described it in your very next sentence  AND your very last one   Compromise is always typified as surrendering. I never said it was  Not for good dealmakers  or anyone who s actually done it.   log in  or  register  to reply  mortiscrum       .  .         AM         Two good deal makers working together will always find a solution they both like and can sell to their followers....  I don t know  that seems pretty optimistic to me. Do you contend that the Israeli Palestinian conflict  pro choice vs pro life  single payer vs free market  etc.  would all be solved if only good deal makers got involved   log in  or  register  to reply   Michael Hihn        .  .         PM         How many times will you repeat the same blunder  Read it again  log in  or  register  to reply   Michael Hihn        .  .         PM         HE DID    How did they manage to force so massive a fuckup by the GOP  Cato  et al  Should he have also mentioned dumbfucks like Cruz and Rand Paul  who BLATANTLY reject the outcomes of a free market    when we had one    universal treatment for the uninsured  regardless of income   log in  or  register  to reply  Uncle Jay       .  .         PM         RE  Senate Republicans Add Individual Mandate Workaround to Health Care Bill  It s one more way the GOP repeal bill resembles Obamacare. The  Me Too  once displays its brotherhood with the democratic party.  Instead of repealing Obamacare and deregulating the healthcare industry  the Me Too party shows the world once again it is embracing socialism a little more enthusiastically each day.  The republican party turning the party of Lincoln into the party of Lenin slowly but surely.  log in  or  register  to reply   Michael Hihn        .  .          PM          yawn  Why do you always shit all over genuine free market outcomes   How will you REPLACE Medicaid with the universal treatment Americans have alway provided for the uninsured  regardless of income  Repeal Medicaid tomorrow  What happens to those people  YOU don t give a shit  which makes you a threat to individual liberty .  The American people give a shit  and are willing to pay for it.  log in  or  register  to reply   Longtobefree        .  .         PM         Just allow the insurance companies to provide reduced benefits for the first two  or whatever number gets negotiated  years if there has not been continuous coverage. That was working fine before Obamacare. I have all my nice little letters labeled  certification of continuous coverage  stuffed in a file somewhere. I suspect the legislature cannot count as high as    days.  No chance of course  that allows personal freedom and all that jazz.  log in  or  register  to reply   Michael Hihn        .  .         PM         Yep.Thank Ted Kennedy for that.  And Nancy Kassebaum  In     . Continuous coverage is ingenious  because it sets aside the vast majority of people who DO NOT wait until they re suck. Simple. No mandate. Just common sense. Even though Cato s Michael Tanner  the worst liberty hustler below Ron Paul  lies about it. This GOP version is just as stupid as the arbitrarily higher premium in their original bullshit.  Proof  Obamacare is approved by     of Americans. TrumpCare by     And Cruz PaulCare by even fewer.  Progressives just kicked their ass again   log in  or  register  to reply   Crusty Juggler is bae.        .  .         PM          It s a backdoor mandate   The Backdoor Mandate  was my nickname in college.  log in  or  register  to reply  Eman       .  .         PM         It would be a good name for a bad band  log in  or  register  to reply   Crusty Juggler is bae.        .  .         PM          the Senate GOP bill now includes a continuous coverage provision  Anyone who goes without coverage for more than    days must wait six months before getting coverage again. The goal  as with the mandate  is to create an incentive for health people to buy coverage and maintain it  by penalizing if they don t.  I can t wait to read        words as to why a libertarian minded individual would approve of this proposal.  log in  or  register  to reply  Social Darwinist       .  .         PM         How does it make sense that punishment for not having coverage for more than X days is to have even more days without coverage  Wow  that is some really harsh punishment that will no doubt have those looking to not purchase coverage run right out and get it.  log in  or  register  to reply  marshaul       .  .         PM         Because if you get sick and suddenly seek coverage  you will have to wait   months. This A  incentivizes maintaining continuous coverage  and B  reduces costs by allowing some of the uninsured sick to die or spontaneously get well  or get well on their own dime  before getting covered.  log in  or  register  to reply   Michael Hihn        .  .         PM         Bullshit. I m   weeks into cancer treatment  and just about done. They caught it early  a  .   tumor  not metastasized. I follow my bills and guess it will be nearly          for   weeks. If I waited six months  it would be much larger  and almost certainly metastasized  so the cost would likely be          or more. That s MORE than the insurer would lose under the Obamacare mandate    just one example of why Suderman is correct that it could increase costs  and hasten the death spiral . Try again. And your  allowing some of the uninsured sick to die  us why progressives are STILL kicking our ass. Because the political elites have no idea what the hell they re doing    both conservative and libertarian.  log in  or  register  to reply  swampwiz       .  .         PM         What I want to know is what is stop someone from simply not getting coverage and then when he gets sick  he simply shows up at an ER  At least with the ObamaRomneyHeritageCare mandate  he has to pay something for not getting coverage  although that mandate is rather toothless . The bottom line is that without repealing EMTALA  this is a crock.  log in  or  register  to reply   Michael Hihn        .  .         PM         It would be as fucking stupid as anything from Rand Paul    who shits all over the outcomes of a free market when we had one  pandering to the goobers who support Rand and Ron.  log in  or  register  to reply   Robert        .  .         AM                   More like    characters  Because it has a chance to pass  amp  is better than the status quo.  log in  or  register  to reply   Curt            .  .         AM         Why is it better  If they can t ditch Obamacare better to let it die on it s own and not be the one left holding the bag.  log in  or  register  to reply   Michael Hihn        .  .         PM         It s Tribal  . In the real world  a total disaster.t  The nitwits have driven Obamacare s approval to over    . Theirs is      now that voters see the GOP has been lying all this time. Has NOTHING. Passage would virtually guarantee single payer  reject free market outcomes and defy the will of the people. Americas have ALWAYS paid  voluntarily to charity  for universal treatment. Until Medicare  The GOP hardliners are now as crazy as the libertarian goobers  REAL libertarians have supported a transition back to private charity    which means returning current government spending to the private care they stole it from. Which is also good politics. duh. FACT  Americans are willing to pay for treatment for the uninsured. There are only two options  NONE of which are in the GOP. Transfer the dollars back to where they belong. If not single payer is the ONLY option that provides what voters want and are willing to pay for... as Lady Liberty is gang raped ... again she s undefended.  Except pro liberty libertarians  NOT anti gubmint goobers across the fiscal right.  log in  or  register  to reply  JWatts       .  .         PM          Instead of a fine for going uncovered  as in Obamacare  the Senate GOP bill now includes a continuous coverage provision  Anyone who goes without coverage for more than    days must wait six months before getting coverage again. The goal  as with the mandate  is to create an incentive for health people to buy coverage and maintain it  by penalizing if they don t.  This is far better than the current mandate which forces young healthy people to get insurance they don t want and which is not in their best interest for the sole purpose of lowering the costs to the rest of the insurance pool.  log in  or  register  to reply  mortiscrum       .  .         PM         For the young healthy people it certainly is. Unfortunately young healthy people don t vote the same way old sick people do. If you were a politician interested in keeping your job  would it be better to    force young people to buy private insurance to balance the insurance pool     raise taxes on the young and healthy   AKA  workers   to directly fund the healthcare expenditures of the old and sick  single payer  basically   or    leave everyone to fend for themselves. And remember  old and sick people vote.  log in  or  register  to reply   Michael Hihn        .  .          PM         That s why Obamacare forces younger and poorer people to subsidize older and richer people. Because redistribution.  log in  or  register  to reply  Tony       .  .         PM         Far better  Or just a dumber way of doing the same thing less effectively  You have to have the mandate in order for insurance to be affordable to people with pre existing conditions. It s the basic framework and logic of the policy.  log in  or  register  to reply  some guy       .  .         PM         Right. You have to force people to support others who have made bad decisions in life. Otherwise  those other people might have to face the negative consequences of their bad decisions and we can t have that.  log in  or  register  to reply  Tony       .  .         PM         Cancer is a  bad life decision    log in  or  register  to reply  some guy       .  .         PM         Not getting health insurance before you get cancer is a  bad life decision . Getting cancer before you have a chance to get health insurance is extremely rare and can easily be handled with charity. It s all about choices and values. The vast majority of uninsured people could get it if they wanted. They just either don t want to work  or want to spend their money on something else.  log in  or  register  to reply  JFree       .  .         PM          Not getting health insurance before you get cancer is a  bad life decision .  Well the reality is that the ACTUAL decision is  Get cancer before you turn    and you are screwed and pay for everything yourself and die soon after you get cancer. Get cancer after you turn    and you get to suck on the public teat and force others to pay everything And golly   the chances of making it to    without getting diagnosed with cancer are pretty much entirely a function of income. So the higher income get to suck on the public teat   while lecturing the lower income about their  bad life decisions .  log in  or  register  to reply  marshaul       .  .         PM          chances of making it to    without getting diagnosed with cancer are pretty much entirely a function of income  Either you don t understand what a  function  is  or you re willfully conflating correlation with causation. There is no coherent mechanistic model to explain your  intentionally or otherwise  implied theory that poverty causes cancer   although it likely does cause worse outcomes  after getting  cancer. Meanwhile  lots of carcinogenic choices   such as cigarette smoking   are very well  correlated  poverty  while obviously bearing little to no direct mechanistic causal relationship with it. Poverty may lead to a decrease in self valuation of life  but that is at some fundamental level a choice. And  while it may not be a choice to be predisposed to bad decision making  when this is the case it reverses the causal direction.  log in  or  register  to reply  JFree       .  .         PM          There is no coherent mechanistic model to explain your  intentionally or otherwise  implied theory that poverty causes cancer  No simple model. But from Mayo Clinic re the gene mutations that cause  note the word cause  cancers    A number of forces can cause gene mutations  such as smoking  radiation  viruses  cancer causing chemicals  carcinogens   obesity  hormones  chronic inflammation and a lack of exercise.  Every one of those  except maybe hormones  is heavily correlated with income. In concert  those individual factors compound. Further  they are also less likely to have access to the primary care doctor who could say  hey this thing or that behavior can cause cancer so let s fix this early  so there is not only increased exposure but longer duration. And yes  once they have cancer  the outcomes are worse too  again an access issue    even adjusting for the later diagnosis  again an access issue . But hey   I m sure it s all just a coinkydink cuz correlation can t ever actually be causation. That s like Internet Stats    . It s all about the  self valuation of life  and the freedom to be poor. Doctors serve no real function. They have no medical knowledge that the average poor person doesn t already have.  log in  or  register  to reply   Michael Hihn        .  .          PM         Then we have the biggest policy assholes of all ... libertarians.   If you get cancer. WE GOT YOU COVERED  You ll have full coverage ... after you pay       .  The goobers swallow thatshitn like candy   log in  or  register  to reply   Michael Hihn        .  .          PM         Shamefully dishonest. And FAILS to justify repealing Medicaid ... instead of a phased transition back to the charities which no longer exists    when Americans willingly paid for the uninsured  regardless of income. I understand why Tony ignores free market outcomes. But how are you any better   log in  or  register  to reply  mortiscrum       .  .         PM         If it s lung cancer it probably was. Not really the point though.  log in  or  register  to reply  BYODB       .  .         PM         Cancer drugs themselves are  of course  a very limited supply so it s only natural that Tony won t get those since he provides no value to society. It seems like he s blissfully unaware of how a government managed system allocates  or doesn t allocate  care. Note how  well  those single payer systems provided healthcare to people who are old  retired  or infirm. Notably  in how they  don t  do those things as much because they re a drain on the system and have worse odd s of successful outcomes. I take this to mean that Tony is a heartless utilitarian  Who knew  So  now I just gotta ask Tony. Why do you hate old people   log in  or  register  to reply   Michael Hihn        .  .         PM         Compared with the libertarian establishment which REJECTS how a free market allocates care.  log in  or  register  to reply  RAHeinlein       .  .         PM         Not just young people   anyone who is not provided with employer government health coverage   self employed  small  generally  business owners  part time workers  etc. As it is now  and even prior to ACA  you are not able to jump on and off insurance  other than enrollment periods  without mitigating circumstances . It s surprising at this point in the healthcare debate that essentially no one writing about this issue has a clue how the current system works. Apparently  Suderman believes in a selective  tax  for those without provided coverage.  log in  or  register  to reply   Michael Hihn        .  .          PM         Apparently  you are totally ignorant of .....  private charity  .. perhaps brainwashed by the Paulista Cult  We know    some of us    that private charity funding groups  hospitals and clinics provided universal treatment to the uninsured  regardless of income  until Medicaid destroyed the entire infrastructure. Goobers BELEEB that Medicaid can be repealed tomorrow    and the entire private care infrastructure will magically arise from the dead and resume treating people. Or  goobers babble a lot of free market slogans . .. but replace market OUTCOMES with authoritarian diktats  and manage to shame the entire libertarian movement. And the real RAHeinlein   log in  or  register  to reply   Michael Hihn        .  .         PM         Nope. It could be FAR worse.  In the case of cancer  for example  the delay could double or triple the cost of cure ... and for any other degenerative disease  almost all of which are THE most costly to delay. Look at PEOPLE  living and breathing ones. Just bashing gubmint often means missing the obvious.  log in  or  register  to reply  Tony       .  .         PM         The problem is the original law is the Republican  free market  approach  as has been explained endlessly  so they re only left with the option of making it work less efficiently in order to  they hope  satisfy the irrational bloodlust of their moronic base. Seriously  Romneycare covers like     of Massachusetts residents and is still functioning well. If Republicans had been less tribal and spent a single minute caring about policy and helping people instead of their neverending ridiculous crusade to be the biggest assholes on the planet  the ACA would be working in their states too. All the ACA is is the three legged stool described in the first couple paragraphs here. It can t function without all three  and it s pretty simple to understand. But even simpler is  President McBlackerson s law is evil because the hedgehog on FOX News said so in my earholes a bunch of times   So I suppose thanks to Republicans for accelerating the conversation toward single payer faster than Democrats ever could have.  log in  or  register  to reply  some guy       .  .         PM          The problem is the original law is the Republican  free market  approach  Which looks nothing like a free market.  satisfy the irrational bloodlust of their moronic base  Someone doesn t know what bloodlust is... Also  it s really hard to take you seriously when you keep tossing ad homs all over the place. It makes you look a bit unhinged.  single payer  Further obscuring the costs of care will not fix the problem. That kind of manipulation is what drives prices up in every industry throughout all of recorded history.  log in  or  register  to reply  Get To Da Chippah       .  .         PM         Nothing screams  free market  like a gigantic layer cake of government mandates.  log in  or  register  to reply   Michael Hihn        .  .         PM         Libertarian  solutions  are just as crazy. Like Medicare vouchers.  log in  or  register  to reply   Michael Hihn        .  .          PM         He nailed the moron part   log in  or  register  to reply  BYODB       .  .         PM         Why not just join the military and get your single payer care today  Tony  It s even managed by Bernie Sanders  so it s just  gotta  be the best care around  right  Especially for our  heros    log in  or  register  to reply  Get To Da Chippah       .  .         PM         Boston Globe   Premiums soar    percent for popular health plan  Mass Live   Higher prices  fewer options as Massachusetts Health Connector begins      enrollment   log in  or  register  to reply   DrZ        .  .         PM         So Republicans  what is wrong with Direct Primary Care  HSAs and true catastrophic insurance. Get employers and the government out of health care and to the extent possible get the government out of healthcare insurance. What are you waiting for   log in  or  register  to reply  Tony       .  .         PM         Well  there are even more people calling for single payer or socialized healthcare  and the senate is about    votes short of a majority for that. And probably about    votes shy of a majority for your plan. That s what.  log in  or  register  to reply  BYODB       .  .         PM         If you think even one quarter of the Democrats would vote for a single payer plan  you re smoking some good shit. There isn t a chance in hell  and if you needed proof of that I offer you the following     Exhibit A    Democrats passed the ACA instead of Single Payer when they literally could have made it Single Payer. Without one single Republican vote. Yet more proof that Tony is actually a brilliant satirist  since he is almost always     degree s wrong about every single issue he talks about. It s actually quite unlikely that someone could be so exactly wrong so often without actually trying.  log in  or  register  to reply  mortiscrum       .  .         PM         The Democratic party of today is a lot more primed for single payer than they were in     . Ben Nelson et al. has left the building. In       Democratic moderates were worried about getting too far away from the center and wouldn t give their votes to single payer. Now in       any moderates that still exist have a much weaker leg to stand on when they push for a more compromising  bipartisan bill. It s been proven to the umpteenth time that neither party is interested in working with the other on healthcare  so they d be better off just going for it.  log in  or  register  to reply  swampwiz       .  .         PM         Wrong  the Democrats of      were timid and  I suppose  thought that ObamaRomneyHeritageCare would be better. Having seen that the mandate has not worked as well as it needed to  they are ready to throw in the towel and go all in for Medicare For All   you know  the type of health care system that Trump said he liked  he mentioned the system like in Scotland  amp  Canada  in front of St. Ronald s Air Force  .  log in  or  register  to reply   Michael Hihn        .  .          PM         Bullshit. They also lie about Heritage Romney.  log in  or  register  to reply   Michael Hihn        .  .          PM         So are you. No offense  but I need to correct the brainwashing you suffer.  Exhibit B  Republicans were offered a bipartisan Obamacare option in       that would have destroyed single payer forever. The strategic dumbfucks refused  so THEY forced Obama to seek the votes of his own far left ... so Republicans OWN the worst parts of Obamacare. Which their tribe doesn t know..  Before the GOP went antti gubmint gooberism    in the     s    the worked they accepted Kennedy s bipartisan tax cuts    which were strongly opposed by far left Congressional Democrats and the AFL CIO as   tax cuts for the rich.  Twenty years later  the SAME tax cuts  still bipartisan were introduced and passed by Reagan.  With Ted Kennedy s vote  The two tax policies  Reagan s and Kennedy s  Presidents from each party  launched the ONLY two peacetime booms since the     s. There s a message here. Do you see it   log in  or  register  to reply  some guy       .  .         PM         They re waiting for people  in general  to stop wanting a free ride  in general . I wouldn t hold my breath.  log in  or  register  to reply   Michael Hihn        .  .          PM         Kinda like libertarians who swallow the bullshit of free tax cuts    from Ron Paul  Cato and the entire lib establishment.  log in  or  register  to reply  BSL        .  .         PM         In other words  read the U.S. Constitution  and allow businesses to offer solutions to customers  problems. The only thing standing in the way is the federal government s need to control the actions of individual citizens. Piece of cake.  log in  or  register  to reply   Michael Hihn        .  .         PM         While YOU control them by mandating employer paid.  Memorized slogans and soundbites rarely solve anything.  log in  or  register  to reply  JFree       .  .         PM          So Republicans  what is wrong with Direct Primary Care  HSAs and true catastrophic insurance...What are you waiting for   Campaign contributions. Neither party gives a rat s ass about actual healthcare. No politician gives a rat s ass about reducing the long term cronyism in healthcare   or the   of GDP that is spent on healthcare   since that will reduce the long term campaign contributions as well. Specialists  hospitals  associations  insurance cos paid good money to buy their pols fair and square. And now you want to overturn all that in order to  solve a problem   Gedoudahere.  log in  or  register  to reply   Michael Hihn        .  .         PM         So called libertarians would mandate them as the only option  because so few people freely choose them  which fucks their narrative. Cut through the bullshit and HSAs are the WORST thing for catastrophic CARE  which is NOT insurance .  You get cancer    there s a catastrophe     and must spend        before your coverage begins. There s nothing close to        in your HSA  because the risk sharing works in reverse. The SAVINGS are shared  spread across the entire group  which means no single employee gets the full savings into their HSA. HSA s original version    under Reagan   did not get carried away with bullshit extremes    by rightwing think tanks hustling money from suckers.with free market slogans and soundbites.  log in  or  register  to reply  swampwiz       .  .         PM         if you think about it  a large deductible is a lot like a yearly HSA in which the money goes back into the insurance pot.  log in  or  register  to reply   Michael Hihn        .  .          PM         Yes  both are kinda stupid  for the reasons I stated. But gooobers.  log in  or  register  to reply  Egypt Steve       .  .         PM         Re    how much of Obamacare s individual market design Republicans have borrowed for their own bill.  Heh. The  Individual Mandate  was thought up in the Heritage Foundation. Neuter Gingrich was for it until he learned  to his horror  that the Kenyan Muslim was adopting it in his plan.  log in  or  register  to reply   Michael Hihn        .  .          PM         Heh ... were you EAGER to be so shamelessly brainwashed   Truth  for tribal lefties    Just the opposire of lies swallowed by tribal righties  and libertarians   log in  or  register  to reply  Budbug       .  .         PM         RINO Socialism is just as Socialistic as Democrat Socialism. Power hungry pols just do not want to relinquish any power gained over the individual. Another dagger in the heart of Liberty.  log in  or  register  to reply  Tionico       .  .         PM         Who don t these elected  representatives  wake up and smell the coffee  WE DON T WANT A MANDATE  nor anything else that looks like  functions like  replaces  or substitutes for one.  What we have been wanting ever since Peligrosi declared  we had to pass the bill to know what s in it  we have wanted full repeal.. FedGov have NO AUTHORITY to meddle in medical care  health insurance  or any other such thing. That means THEY CANNOT. The very fact they are is unconstitutional. WHY don t these dweebs READ that Constitution they swore to uphold  defend  enforce  They all swore an oath to do so. To make such an oath and knowingly fail to uphold it is perjury  an actionable crime that would take every one of them out of office. But here they go.... whatever THEY want  never mind what WE want.  log in  or  register  to reply   Michael Hihn        .  .          PM         Who s  we  Mein Fuhrer  Wake up. Smell the coffee. Suderman explained it. Americans are       on a mandate  The vast majority of Americans want guaranteed issue .. which is mathematically impossible without a mandate. After Obama was elected  after campaigning AGAINST a mandate  but before taking office  the insurance industry proposed to accept guaranteed issue in exchange for a mandate. They immediately outflanked Obama. And if Republicans pass guaranteed issue without a mandate ... which would ACCELERATE the premium death spiral ... the industry will cut their balls off with a dull knife. Stop screeching. You look like a fool arguing against the core principle that   governments derive their just powers from the consent of the governed.  That makes you just as authoritarian as Obama  Pelosi and both Pauls.  log in  or  register  to reply  Tionico       .  .         PM         Who don t these elected  representatives  wake up and smell the coffee  WE DON T WANT A MANDATE  nor anything else that looks like  functions like  replaces  or substitutes for one.  What we have been wanting ever since Peligrosi declared  we had to pass the bill to know what s in it  we have wanted full repeal.. FedGov have NO AUTHORITY to meddle in medical care  health insurance  or any other such thing. That means THEY CANNOT. The very fact they are is unconstitutional. WHY don t these dweebs READ that Constitution they swore to uphold  defend  enforce  They all swore an oath to do so. To make such an oath and knowingly fail to uphold it is perjury  an actionable crime that would take every one of them out of office. But here they go.... whatever THEY want  never mind what WE want.  log in  or  register  to reply  Blue Star       .  .         AM          What we have been wanting ever since Peligrosi declared  we had to pass the bill to know what s in it  we have wanted full repeal..  A Drumpfista lying about myths he has been force fed through Drumpf s discard IV  log in  or  register  to reply   Michael Hihn        .  .         AM         Blue Star  you expended all your energy on raging bigotry. instead of simply saying she never said that ... with a link to the proof   https   www.youtube.com watch v hV   TLiiLU  But even that s not as crazy as the lie that Obama said  We are no longer a Christian nation.   That assholery required an IMMEDIATE cut to hide what he really said.  log in  or  register  to reply  swampwiz       .  .         PM         And every single yahoo that gets told  no health care for you  would be become an instant supporter of Medicare For All.  log in  or  register  to reply   Michael Hihn        .  .          PM         Yep. The vast majority of Americans WANT universal treatment for the uninsured  regardless of income ... and ALWAYS paid for it when we had a free market. So the anti gubmint libertarian goobers are THE greatest threat to individual liberty. They either support what the people want  by evolving back to private charities .. or progressives will CONTINUE kicking their ass with the ONLY preferred outcome. Repealing Medicaid without FIRST beginning the transition is ... authoritarian  like moist of their shit.  log in  or  register  to reply  tommhan       .  .         AM         I don t think people should ever be forced to buy insurance on one hand but I know that these programs do not function without the proceeds from payments on the other hand so either I compromise my belief system or I admit that I do not care about health care for people unable to purchase it for themselves from circumstances in their control or not. This is a personal conundrum for me.  log in  or  register  to reply  Blue Star       .  .         AM         Simple solution  get government out of healthcare. If you do not have verifiable means to pay for your healthcare  you do not get it. It is the libertarian way. GUARANTEED that it will work. So guaranteed that no one will even think of  but what if it does not work   That is planning.  log in  or  register  to reply   Michael Hihn        .  .         AM         You re full of shit    DEFYING the outcomes of free markets  as you shame the cause of individual liberty  Only anti gubmint libertarians  who are authoritarian   PRO LIBERTY libertarians know that human have CHOSEN to assure universal TREATMENT since the     s.  In this country  we had a free market in treating the uninsured  REGARDLESS of income  and had universal TREATMENT    at charity hospitals and clinics  financed by a complex web of churches  charities and organizations . THAT is what the free market did. Who the FUCK are you to defy the what Americans want done ... and have always been willing to pay for  But you re a very effective recruiter for Bernie Sanders. If WE don t SHOW a better way to provide universal treatment  ... then Bernnie has the only option  and he can point to YOUR words.    If you do not have verifiable means to pay for your healthcare  you do not get it.   REAL libertarians have been proposing transitions from government back to the private sector    which must be rebuilt from scratch. That must be an orderly phase in  which transfers the money at the timing and pace to do it right. Stop calling yourself libertarian.    Governments derive their just powers by the consent of the governed   Not your diktats.  log in  or  register  to reply  JFree       .  .          AM          In this country  we had a free market in treating the uninsured  REGARDLESS of income  and had universal TREATMENT    at charity hospitals and clinics  financed by a complex web of churches  charities and organizations.  That stopped being true in     . The      influenza pandemic changed everything. The upper middle class did not want the hoi polloi anywhere near them in hospital   and the pandemic proved that charity voluntarism had no fucking chance of remotely dealing with anything epidemiological. Private non profits chose to move upscale  to target those who could pay  and became much more selective in the pro bono charity cases they took on   and remained so until well into the      s when EMTALA mandated that if they accept govt money  they gotta accept patients on a purely medical basis too. That s also why municipal hospitals started being built in large numbers   and by the late      s  just before employers got their tax deduction to pay for employee health in         those muni hospitals were the ones that were filled treating the uninsured       capacity utilization vs     for private non profits  for even non epidemic stuff. The reality is that the free market does not have a very good way of dealing with this weird combination of factors that are unique to medical care   esp since land  the underlying factor behind capacity utilization  is ignored in modern economics.  log in  or  register  to reply   Michael Hihn        .  .          AM          ANOTHER blunder for JFree    boldface for the reading and thiinking BULLSHIT  It continued until shortly after Medicaid.  for the uninsured. FDR created today s fucked up system.  We did fine for the uninsured until LBJ s liberal fuckup. Had universal treatment. Now it s a  right     but Medicaid CHIP eligibles are THE highest rate of uninsured in America  This is just prior to Obamcare  smirk     That you people place politics above human life is a moral outrage.   Medicare has    TRILLION of unfunded promises  so why is Medicaid so tragically undrerfunded  Seniors vote. Poor people do not.  puke   log in  or  register  to reply  Blue Star       .  .         AM         Nice try  reason.com Republicans posing as libertarians. The BCRA is a fully owned tax cut by the Republicans for their donors. Just be honest enough to call it that. And stop making it  Obamacare lite.  It is not.    million fewer insured is not Obamacare which added to the rolls.  log in  or  register  to reply   Michael Hihn        .  .         AM         How would you know  Your own immediately previous post shows you re .... a fake libertarian .. defying free market outcomes ... and the Will of the People.     You just DEFENDED a LOT MORE uninsured.   http   reason.com blog        .....nt           log in  or  register  to reply  Vjklander       .  .         AM         The only rational health care system   Health care is not a right  it is a commodity. Period. Every speck of healthcare goods and services is the result of some persons labor. Any time there is a  rd party payer  there is no incentive for the principles to restrain costs. Indeed  there is every incentive to spend flagrantly.  These are some easy ways to cut costs  and increase quality of health care. The most important thing is to use free market forces to drive down the cost and drive up the quality of health care itself   log in  or  register  to reply  Vjklander       .  .         AM          . Control the trial lawyers. Limit awards to actual damages with an additional        of that for ancillary factors unless the health care provider is convicted of a crime   . Require all health care providers of goods and services to post their prices   . Require all health care providers of goods and services to provide a written estimate   . Health care providers of goods and services can set their own prices  but they must charge the same amount to all customers   with a write down provision only for individuals   . Create a before tax health care IRA into which you can deposit as much as you want at any time  but not to exceed        above the actual expenditures per year   . Allow any individual to contribute tax free dollars to anyone else s HCIRA   . Employer health care to be contributions to employees HCIRA   . HCIRA used to pay for all medical expenses  including insurance premiums   . Any error in billing will require the provider and or insurer to be cut the bill in half.    errors in billing will negate the bill    . HCIRA is heritable    . Allow buying any insurance policy from any insurance company anywhere  paid from the HCIRA    . Prohibit any health care providers of goods and services from disclosing consumers  identifying information to the federal government    . Allow insurers to write short term negative outcome insurance policies    . Allow all kinds of medi share and other such associations    . Government assistance subsidies would be worked through the HCIRA  log in  or  register  to reply   Michael Hihn        .  .         PM         Because so few employees would choose it among options   log in  or  register  to reply  Ed Krayewski         .  .       Zach Weissmueller                                           .  .       VIEW HIT  amp  RUN ARCHIVES                 .  .        am               .  .        pm               .  .        am               .  .        am               .  .        am   Jonathan Haidt         .  .        am   Dan King         .  .         am   Damon Root         .  .        pm   Jim Epstein         .  .         am   Christian Britschgi         .  .        am             John Stossel                      Maxim Lott                      Alexis Garcia                      Paul Detrick           Peter Suderman Damon Root Jim Epstein  amp  Ian Keyser Jacob Sullum Stephanie Slade Anthony  L. Fisher Nick Gillespie Jim Epstein  amp  Mark McDaniel Nick Gillespie Scott Shackford Andrew Heaton  amp  Ian Keyser Ed Krayewski Jacob Sullum Meredith  Bragg Steve Chapman Emily Ekins Emily Ekins Emily Ekins Jacob Levy Daniel McCarthy Eric Boehm           Reason Foundation.    reason.org         privacy policy     terms of use     eval unescape          a              d  b                                                                       c  b                                   c                                                              d  e                             e  a  f     e        e        d  e  a  f     e                 b  b                    d                 e           c                          b     b     f        d     e     e                    b                    e  c     e  b        d           b     c     f  a     b        a                    b       ","                      The bill would reshape the tax code in favor of corporations and do more to undercut Obamacare than anything Republicans have yet managed to pass.          Senate Republicans passed their version of a massive tax overhaul just before   a.m. Saturday morning  knocking off one more obstacle to President Donald Trump and the Republican Congress s first major legislative achievement this year. The bill   the final text of which was released publicly after      p.m. Friday  and still contained scribbles in the margins   would vastly rewrite how the US tax code works  favoring corporations large and small  owned by a few partners or by a globally diversified shareholder base. The bill would also be Trump and the Republican Congress s biggest step in unwinding the Affordable Care Act  as it would eliminate the individual mandate to buy health insurance. The Congressional Budget Office estimates that the change would jack up premiums and lead to    million more uninsured people than there would otherwise be in    years  and   million more in     . The Senate passed the bill        with Sen. Bob Corker the only Republican voting against the bill. Vice President Mike Pence was on hand to preside over the vote  and was met with applause after reading out the final tally. Frustrated Democrats  meanwhile  had abandoned the floor after voting. Speaking to reporters as he left the White House for New York City on Saturday morning  President Trump praised the senators for passing  tremendous tax reform.   People are going to be very  very happy. They re going to get tremendous  tremendous tax cuts and tax relief  and that s what this country needs   he said. Trump this morning on tax bill   It was the biggest package in terms of tax cuts ever passed in our country...peopl  https   t.co zFSba z Lz The next step for the legislation is up to the House of Representatives. The House can either pass the Senate s bill as is  or go to conference with the Senate to meld the bill with the legislation House Republicans recently  passed . The House bill has a different structure for individual tax rates and a different approach to taxing businesses run by their owners than the Senate bill  and it includes a complete elimination of the estate tax. The House bill also scraps the deduction people can claim for medical expenses and puts the     corporate rate into effect faster. House leadership is  currently planning  on moving to a conference to combine the bills as quickly as possible. In a  statement  Saturday morning  House Speaker Paul Ryan congratulated Senate Republicans on the bill and said   Now we will move quickly to a conference committee so we can get a final bill to President Trump s desk.  Trump tweeted just before   a.m. on Saturday that he hopes to reach that point before the end of the year. We are one step closer to delivering MASSIVE tax cuts for working families across America. Special thanks to  https   t.co L  UncQMZS For now  the feeling among Senate Republicans is emphatically positive.  This is a great day for America   Senate Majority Leader Mitch McConnell told reporters after the vote Saturday morning.  After an up and down several days  Republican leaders were bullish on the bill for most of the day Friday. Senate leadership appeared to have secured    votes for the bill Friday afternoon  well before the bill was finalized.  I m ecstatic   Sen. David Perdue told BuzzFeed News late Friday night.  The publicly released Senate tax bill they re voting on tonight still has the infamous scribbles Senate Democrats were livid about the bill and the process that played out Friday night  as a flow of late changes were made to the bill just before it came to the floor for a vote.  Historians will mark today as one of the darkest black letter days in the long history of the Senate   Senate Minority Leader Chuck Schumer said from the floor  soon before the vote. The bill  he said   was chock full of special interest giveaways before tonight  but under the cover of darkness and with the aid of haste  a flurry of last minute changes will stuff even more money into the pockets of the wealthy and the biggest corporations  while raising taxes on millions in the middle class.   McConnell hit back at Schumer in his own comments after the vote.  You complain about process when you re losing   he said. Senate Democrats seized upon one obscure amendment late Friday night that they claimed would exempt a single Michigan liberal arts school  Hillsdale College  from a new tax on endowment income. The college is a conservative beacon in the culturally liberal higher education world. It rejects most federal funding  including student loans  and many of its students go on to work in conservative movement institutions. Erik Prince  the brother of Education Secretary Betsy DeVos and founder of the controversial security firm Blackwater  is one prominent alumnus. Sen. Pat Toomey  who included the amendment  defended the college on the Senate floor.  I actually think it s a wonderful institution... I commend them for their choice  as other colleges  of foregoing taxpayer money that they could be taking... I think any college in that category  whether it s Hillsdale or any other college  ought not to have to pay the tax on endowment.   Schumer described the amendment as a  metaphor for the whole bill.  The fate of the amendment  though  proved a lonely bright spot for Democrats  It was defeated just after   a.m.  soon before the final vote  with four Republicans joining all Democrats in voting against it.  I was just handed a     page tax bill a few hours before the vote. One page literally has hand scribbled policy cha  https   t.co JdMIEfWZgj In order to pay for at least some of the large cuts in the Senate plan   businesses run by their owners would be able to deduct     of their income before paying taxes  while the rate paid by corporations on their income would fall to       a wide swathe of deductions enjoyed by higher income wage earners would fall away  notably the deduction for state and local taxes.  The amount that these businesses   which include everything from dry cleaners to real estate partnerships   would be able to deduct from their tax bills was a key point of contention among Republicans going into Friday. Sens. Steve Daines and Ron Johnson only came on board with the bill Friday morning  after the deduction moved up from   .   to     over the past week. In order to pay for broader and deeper cuts  the Senate also scrapped their total repeal of the alternative minimum tax for individuals   a separate tax system that s supposed to ensure that people don t use deductions to excessively wipe out their tax liability. Getting rid of the AMT was supposed to be one of the ways the House and Senate tax bills would simplify the code. Instead  the Senate put the tax system back into the bill with modifications on Friday. The House bill eliminates the tax.  Throughout Friday  senators who had held out because of their concern about tax cuts not being extensive enough won key concessions  while those that were on the fence because they thought the bill would expand deficits too much walked away with less solid commitments. Sen. Susan Collins  the Maine Republican who voted against the Senate s health care bill and was viewed as a key vote for the tax plan  got several amendments into the bill  including letting taxpayers deduct the first         of their property tax bills from their federal taxes.  I think we should be cutting everyone s taxes   Sen. Ted Cruz said.  Susan Collins prevailed in amending the bill to exclude         of property taxes from your federal income tax liability   that s a significant improvement.  As the bill was being rewritten Thursday night and through Friday  Republicans were able to scrounge up money to allow them to further cut taxes without increasing the cost of the bill  but rejected entirely proposals to reduce the fiscal impact as a whole. After the bill hit a snag Thursday night  Republicans were discussing adding automatic increases in the corporate tax from its proposed     rate in order to eliminate at least      billion in added debt over the next    years. This was at the urging of Sen. Bob Corker  who had earlier proposed an automatic tax hike if the bill didn t raise enough money from added economic growth. That so called  trigger  option was rejected by the Senate parliamentarian due to rules that allowed the Senate to pass the bill with only a bare majority of votes  leaving the Senate to look elsewhere for ways to assuage Corker as well as Sen. Jeff Flake. By Friday morning  however  the tax hikes were dead.  It was extended conversation that went on into the late hours of the night and continued early in the morning   Cruz said Friday  explaining how the Senate came to reject the hikes entirely.  I and a number of other senators had strong objections to that proposal  and that proposal did not carry the day. The      billion in tax increases is not in the bill   that was the right thing to do.  Corker was unable to bring any Republicans with him to vote against the bill   Sens. James Lankford and Jeff Flake  who had originally supported a  trigger  mechanism and did not declare their position on the bill until late this week  did not join Corker.  I ve never tried to rally  them    each person has to vote their conscience and that s what this is all about   Corker said.  I am disappointed. I wanted to get to yes. But at the end of the day  I am not able to cast aside my fiscal concerns and vote for legislation that I believe  based on the information I currently have  could deepen the debt burden on future generations   Corker said in a statement.  I m a dinosaur on the fiscal issues   he said earlier Friday. Other Republicans mainly had praise for Corker  despite his dissenting vote.  I respect Bob so much as senator   Perdue told BuzzFeed News late Friday night. Trump and Corker  had a really great conversation   he added.  Bob called the president  there was a clearing of the minds. It was very professional. I m sure the President tried to beseech him. I m very impressed with Bob and how he handled this.  Sen. Corker on Nov.   . The bill includes  at least temporarily  some direct benefits for normal taxpayers  The standard deduction that people are allowed to lop off their taxable income if they don t claim other deductions would increase from        to         for individuals  and from         to         for married couples  while the child tax credit would be expanded up to        from       . For wealthy taxpayers  there are direct benefits as well  The first     million of estates transferred upon death would go untaxed  while the top overall tax rate would fall to   .   from   .  . But the Senate s tax bill is hardly static. It will force future Congresses and presidents to make choices about whether to continue its benefits for middle income taxpayers or possibly expand the deficit even further than currently projected. The Joint Committee on Taxation  Congress s tax scorekeepers  projected Thursday that  even accounting for the effects on economic growth  the bill would add    trillion to the deficit over    years. But that s assuming that most of the personal tax changes expire at the end of       as they re scheduled to under the bill. The final projection could also still change somewhat  as the JCT s Thursday estimate was based on earlier text of the bill. The bill includes a change in the way tax brackets grow  meaning that over time  as individuals  incomes went up  they would enter a new bracket and pay a higher marginal rate. By       about half of all taxpayers would be paying more in taxes than they would otherwise  according to the Tax Policy Center  while higher income taxpayers would be paying less. If nothing is allowed to expire  the Committee for a Responsible Federal Budget estimates that the real cost of the tax bill in    years would be over    trillion in new debt. These estimates have been hotly contested by most Republican senators  who insist that the bill would generate such high economic growth that it would wash out most negative effects on the debt  and would supercharge wages paid to most American workers.  I m totally confident this is a revenue neutral bill   actually a revenue producer   McConnell said after the final vote.   The best way to pay down the deficit is economic growth and cutting taxes   Cruz said earlier Friday.  In order to get the bill passed  Trump has also committed to supporting two pieces of legislation before the end of the year that would help partially alleviate the spike in insurance premiums that would come from fewer people buying into Obamacare s individual market. But what will emerge from the conference process and whether it will gain the assent of both the House and Senate remains to be seen.  One step at a time   I don t want to get ahead of myself   Sen. Lisa Murkowski  a key yes vote for the bill  said.  We will deal with what happens in conference when we have the opportunity to do that.   Twelve Republican members of the House of Representatives  sent a letter to McConnell  opposing a provision in the Senate tax bill that would open up the Arctic National Wildlife Refuge in Alaska to energy exploration  which was not included in the House bill but is a major priority for Murkowski.  I plan to do everything that I can to make sure that the promise to Alaska is fulfilled and they open up ANWR   Murkowski said. Murkowski was celebratory after the bill passed with the ANWR measure included.  We have been trying to open to oil and gas production for    years now   she told reporters.  I m sure they re back channelling discussions   Senate Majority Whip John Cornyn said earlier Friday about any negotiations between the House and Senate.  I ve always expected there d be a conference with the House   there s a number of things we ve done that they didn t do that has to be reconciled one way or the other.         Matthew Zeitlin is a business reporter for BuzzFeed News and is based in New York. Zeitlin reports on Wall Street and big banks.             Contact Matthew Zeitlin at  matt.zeitlin buzzfeed.com .            Got a confidential tip   Submit it here .       Great                      You re almost there  Check your inbox and confirm your subscription now                  Great                      You re almost there  Check your inbox and confirm your subscription now                   BuzzFeed Home  Sitemap        BuzzFeed  Inc.","When House Republicans passed a draconian healthcare plan back in May  Donald Trump rushed to the Rose Garden to celebrate this   very  very incredibly well crafted   plan. But that was a long time ago. Today  Trump met with Senate Republicans about the new bill that they are attempting to put together  and he reportedly urged them to make this one less  mean.  The  Associated Press  reports that Trump met with    GOP senators for a lunch to discuss the new bill that is currently being drawn up. The bill from the House was pronounced  dead on arrival  the minute it passed last month. Among  other things   the bill would cause    million people to lose their insurance according to estimates from the  Congressional Budget Office . At the time  that didn t stop Trump from having a  stomach turning celebration  in front of the press. He called the bill a   great plan    but has never really gone into specifics about what s great about it. As he does  he quickly shifted attention to himself at the press conference.   I ve  only been a politician for a short period of time    he marveled .  How am I doing  Am I doing okay  I m president. Heh  Hey  I m president   It was true.  Advertisement   What doesn t appear to be true is that Trump thinks the House bill is a   very  very incredibly well crafted   plan. According to congressional sources speaking to the AP  he said that the new bill should be  more generous  more kind  and that the House s proposal was  mean  mean  mean.  He reportedly did not specify what parts of the bill he was referring to and it s possible he doesn t even know. Sources tell  Politico  that he  has shown little interest in what is in the bill   he just disliked the media coverage of it. It s an incredible illustration of Trump s managerial style. He essentially wants Republicans to defy the laws of physics and deliver a plan that s cheaper  covers more people  is voluntary  and makes America great again  I guess. But he has zero interest in how any of that would be accomplished  or if it s even possible outside of a single payer system. Looking for specific suggestions from Trump in recent days  the  best you can find  is   I suggest that we add more dollars to Healthcare and make it the best anywhere.  How s he doing everybody  He s president. Heh  Staff Reporter "]}